grevaillot/svd_tools/headers/ATSAM3X8H/pwm.h
#pragma once 

/* --- PWM: Pulse Width Modulation Controller ----------------------- */

/** @defgroup pwm_registers Pulse Width Modulation Controller Register
@{*/

/** PWM_CLK PWM Clock Register **/
#define PWM_CLK			MMIO32(PWM_BASE + 0x00)
/** PWM_ENA PWM Enable Register **/
#define PWM_ENA			MMIO32(PWM_BASE + 0x04)
/** PWM_DIS PWM Disable Register **/
#define PWM_DIS			MMIO32(PWM_BASE + 0x08)
/** PWM_SR PWM Status Register **/
#define PWM_SR			MMIO32(PWM_BASE + 0x0c)
/** PWM_IER1 PWM Interrupt Enable Register 1 **/
#define PWM_IER1			MMIO32(PWM_BASE + 0x10)
/** PWM_IDR1 PWM Interrupt Disable Register 1 **/
#define PWM_IDR1			MMIO32(PWM_BASE + 0x14)
/** PWM_IMR1 PWM Interrupt Mask Register 1 **/
#define PWM_IMR1			MMIO32(PWM_BASE + 0x18)
/** PWM_ISR1 PWM Interrupt Status Register 1 **/
#define PWM_ISR1			MMIO32(PWM_BASE + 0x1c)
/** PWM_SCM PWM Sync Channels Mode Register **/
#define PWM_SCM			MMIO32(PWM_BASE + 0x20)
/** PWM_SCUC PWM Sync Channels Update Control Register **/
#define PWM_SCUC			MMIO32(PWM_BASE + 0x28)
/** PWM_SCUP PWM Sync Channels Update Period Register **/
#define PWM_SCUP			MMIO32(PWM_BASE + 0x2c)
/** PWM_SCUPUPD PWM Sync Channels Update Period Update Register **/
#define PWM_SCUPUPD			MMIO32(PWM_BASE + 0x30)
/** PWM_IER2 PWM Interrupt Enable Register 2 **/
#define PWM_IER2			MMIO32(PWM_BASE + 0x34)
/** PWM_IDR2 PWM Interrupt Disable Register 2 **/
#define PWM_IDR2			MMIO32(PWM_BASE + 0x38)
/** PWM_IMR2 PWM Interrupt Mask Register 2 **/
#define PWM_IMR2			MMIO32(PWM_BASE + 0x3c)
/** PWM_ISR2 PWM Interrupt Status Register 2 **/
#define PWM_ISR2			MMIO32(PWM_BASE + 0x40)
/** PWM_OOV PWM Output Override Value Register **/
#define PWM_OOV			MMIO32(PWM_BASE + 0x44)
/** PWM_OS PWM Output Selection Register **/
#define PWM_OS			MMIO32(PWM_BASE + 0x48)
/** PWM_OSS PWM Output Selection Set Register **/
#define PWM_OSS			MMIO32(PWM_BASE + 0x4c)
/** PWM_OSC PWM Output Selection Clear Register **/
#define PWM_OSC			MMIO32(PWM_BASE + 0x50)
/** PWM_OSSUPD PWM Output Selection Set Update Register **/
#define PWM_OSSUPD			MMIO32(PWM_BASE + 0x54)
/** PWM_OSCUPD PWM Output Selection Clear Update Register **/
#define PWM_OSCUPD			MMIO32(PWM_BASE + 0x58)
/** PWM_FMR PWM Fault Mode Register **/
#define PWM_FMR			MMIO32(PWM_BASE + 0x5c)
/** PWM_FSR PWM Fault Status Register **/
#define PWM_FSR			MMIO32(PWM_BASE + 0x60)
/** PWM_FCR PWM Fault Clear Register **/
#define PWM_FCR			MMIO32(PWM_BASE + 0x64)
/** PWM_FPV PWM Fault Protection Value Register **/
#define PWM_FPV			MMIO32(PWM_BASE + 0x68)
/** PWM_FPE1 PWM Fault Protection Enable Register 1 **/
#define PWM_FPE1			MMIO32(PWM_BASE + 0x6c)
/** PWM_FPE2 PWM Fault Protection Enable Register 2 **/
#define PWM_FPE2			MMIO32(PWM_BASE + 0x70)
/** PWM_ELMR[0] PWM Event Line 0 Mode Register **/
#define PWM_ELMR[0]			MMIO32(PWM_BASE + 0x7c)
/** PWM_ELMR[1] PWM Event Line 0 Mode Register **/
#define PWM_ELMR[1]			MMIO32(PWM_BASE + 0x80)
/** PWM_SMMR PWM Stepper Motor Mode Register **/
#define PWM_SMMR			MMIO32(PWM_BASE + 0xb0)
/** PWM_WPCR PWM Write Protect Control Register **/
#define PWM_WPCR			MMIO32(PWM_BASE + 0xe4)
/** PWM_WPSR PWM Write Protect Status Register **/
#define PWM_WPSR			MMIO32(PWM_BASE + 0xe8)
/** PWM_TPR Transmit Pointer Register **/
#define PWM_TPR			MMIO32(PWM_BASE + 0x108)
/** PWM_TCR Transmit Counter Register **/
#define PWM_TCR			MMIO32(PWM_BASE + 0x10c)
/** PWM_TNPR Transmit Next Pointer Register **/
#define PWM_TNPR			MMIO32(PWM_BASE + 0x118)
/** PWM_TNCR Transmit Next Counter Register **/
#define PWM_TNCR			MMIO32(PWM_BASE + 0x11c)
/** PWM_PTCR Transfer Control Register **/
#define PWM_PTCR			MMIO32(PWM_BASE + 0x120)
/** PWM_PTSR Transfer Status Register **/
#define PWM_PTSR			MMIO32(PWM_BASE + 0x124)
/** PWM_CMPV0 PWM Comparison 0 Value Register **/
#define PWM_CMPV0			MMIO32(PWM_BASE + 0x130)
/** PWM_CMPVUPD0 PWM Comparison 0 Value Update Register **/
#define PWM_CMPVUPD0			MMIO32(PWM_BASE + 0x134)
/** PWM_CMPM0 PWM Comparison 0 Mode Register **/
#define PWM_CMPM0			MMIO32(PWM_BASE + 0x138)
/** PWM_CMPMUPD0 PWM Comparison 0 Mode Update Register **/
#define PWM_CMPMUPD0			MMIO32(PWM_BASE + 0x13c)
/** PWM_CMPV1 PWM Comparison 1 Value Register **/
#define PWM_CMPV1			MMIO32(PWM_BASE + 0x140)
/** PWM_CMPVUPD1 PWM Comparison 1 Value Update Register **/
#define PWM_CMPVUPD1			MMIO32(PWM_BASE + 0x144)
/** PWM_CMPM1 PWM Comparison 1 Mode Register **/
#define PWM_CMPM1			MMIO32(PWM_BASE + 0x148)
/** PWM_CMPMUPD1 PWM Comparison 1 Mode Update Register **/
#define PWM_CMPMUPD1			MMIO32(PWM_BASE + 0x14c)
/** PWM_CMPV2 PWM Comparison 2 Value Register **/
#define PWM_CMPV2			MMIO32(PWM_BASE + 0x150)
/** PWM_CMPVUPD2 PWM Comparison 2 Value Update Register **/
#define PWM_CMPVUPD2			MMIO32(PWM_BASE + 0x154)
/** PWM_CMPM2 PWM Comparison 2 Mode Register **/
#define PWM_CMPM2			MMIO32(PWM_BASE + 0x158)
/** PWM_CMPMUPD2 PWM Comparison 2 Mode Update Register **/
#define PWM_CMPMUPD2			MMIO32(PWM_BASE + 0x15c)
/** PWM_CMPV3 PWM Comparison 3 Value Register **/
#define PWM_CMPV3			MMIO32(PWM_BASE + 0x160)
/** PWM_CMPVUPD3 PWM Comparison 3 Value Update Register **/
#define PWM_CMPVUPD3			MMIO32(PWM_BASE + 0x164)
/** PWM_CMPM3 PWM Comparison 3 Mode Register **/
#define PWM_CMPM3			MMIO32(PWM_BASE + 0x168)
/** PWM_CMPMUPD3 PWM Comparison 3 Mode Update Register **/
#define PWM_CMPMUPD3			MMIO32(PWM_BASE + 0x16c)
/** PWM_CMPV4 PWM Comparison 4 Value Register **/
#define PWM_CMPV4			MMIO32(PWM_BASE + 0x170)
/** PWM_CMPVUPD4 PWM Comparison 4 Value Update Register **/
#define PWM_CMPVUPD4			MMIO32(PWM_BASE + 0x174)
/** PWM_CMPM4 PWM Comparison 4 Mode Register **/
#define PWM_CMPM4			MMIO32(PWM_BASE + 0x178)
/** PWM_CMPMUPD4 PWM Comparison 4 Mode Update Register **/
#define PWM_CMPMUPD4			MMIO32(PWM_BASE + 0x17c)
/** PWM_CMPV5 PWM Comparison 5 Value Register **/
#define PWM_CMPV5			MMIO32(PWM_BASE + 0x180)
/** PWM_CMPVUPD5 PWM Comparison 5 Value Update Register **/
#define PWM_CMPVUPD5			MMIO32(PWM_BASE + 0x184)
/** PWM_CMPM5 PWM Comparison 5 Mode Register **/
#define PWM_CMPM5			MMIO32(PWM_BASE + 0x188)
/** PWM_CMPMUPD5 PWM Comparison 5 Mode Update Register **/
#define PWM_CMPMUPD5			MMIO32(PWM_BASE + 0x18c)
/** PWM_CMPV6 PWM Comparison 6 Value Register **/
#define PWM_CMPV6			MMIO32(PWM_BASE + 0x190)
/** PWM_CMPVUPD6 PWM Comparison 6 Value Update Register **/
#define PWM_CMPVUPD6			MMIO32(PWM_BASE + 0x194)
/** PWM_CMPM6 PWM Comparison 6 Mode Register **/
#define PWM_CMPM6			MMIO32(PWM_BASE + 0x198)
/** PWM_CMPMUPD6 PWM Comparison 6 Mode Update Register **/
#define PWM_CMPMUPD6			MMIO32(PWM_BASE + 0x19c)
/** PWM_CMPV7 PWM Comparison 7 Value Register **/
#define PWM_CMPV7			MMIO32(PWM_BASE + 0x1a0)
/** PWM_CMPVUPD7 PWM Comparison 7 Value Update Register **/
#define PWM_CMPVUPD7			MMIO32(PWM_BASE + 0x1a4)
/** PWM_CMPM7 PWM Comparison 7 Mode Register **/
#define PWM_CMPM7			MMIO32(PWM_BASE + 0x1a8)
/** PWM_CMPMUPD7 PWM Comparison 7 Mode Update Register **/
#define PWM_CMPMUPD7			MMIO32(PWM_BASE + 0x1ac)
/** PWM_CMR0 PWM Channel Mode Register (ch_num = 0) **/
#define PWM_CMR0			MMIO32(PWM_BASE + 0x200)
/** PWM_CDTY0 PWM Channel Duty Cycle Register (ch_num = 0) **/
#define PWM_CDTY0			MMIO32(PWM_BASE + 0x204)
/** PWM_CDTYUPD0 PWM Channel Duty Cycle Update Register (ch_num = 0) **/
#define PWM_CDTYUPD0			MMIO32(PWM_BASE + 0x208)
/** PWM_CPRD0 PWM Channel Period Register (ch_num = 0) **/
#define PWM_CPRD0			MMIO32(PWM_BASE + 0x20c)
/** PWM_CPRDUPD0 PWM Channel Period Update Register (ch_num = 0) **/
#define PWM_CPRDUPD0			MMIO32(PWM_BASE + 0x210)
/** PWM_CCNT0 PWM Channel Counter Register (ch_num = 0) **/
#define PWM_CCNT0			MMIO32(PWM_BASE + 0x214)
/** PWM_DT0 PWM Channel Dead Time Register (ch_num = 0) **/
#define PWM_DT0			MMIO32(PWM_BASE + 0x218)
/** PWM_DTUPD0 PWM Channel Dead Time Update Register (ch_num = 0) **/
#define PWM_DTUPD0			MMIO32(PWM_BASE + 0x21c)
/** PWM_CMR1 PWM Channel Mode Register (ch_num = 1) **/
#define PWM_CMR1			MMIO32(PWM_BASE + 0x220)
/** PWM_CDTY1 PWM Channel Duty Cycle Register (ch_num = 1) **/
#define PWM_CDTY1			MMIO32(PWM_BASE + 0x224)
/** PWM_CDTYUPD1 PWM Channel Duty Cycle Update Register (ch_num = 1) **/
#define PWM_CDTYUPD1			MMIO32(PWM_BASE + 0x228)
/** PWM_CPRD1 PWM Channel Period Register (ch_num = 1) **/
#define PWM_CPRD1			MMIO32(PWM_BASE + 0x22c)
/** PWM_CPRDUPD1 PWM Channel Period Update Register (ch_num = 1) **/
#define PWM_CPRDUPD1			MMIO32(PWM_BASE + 0x230)
/** PWM_CCNT1 PWM Channel Counter Register (ch_num = 1) **/
#define PWM_CCNT1			MMIO32(PWM_BASE + 0x234)
/** PWM_DT1 PWM Channel Dead Time Register (ch_num = 1) **/
#define PWM_DT1			MMIO32(PWM_BASE + 0x238)
/** PWM_DTUPD1 PWM Channel Dead Time Update Register (ch_num = 1) **/
#define PWM_DTUPD1			MMIO32(PWM_BASE + 0x23c)
/** PWM_CMR2 PWM Channel Mode Register (ch_num = 2) **/
#define PWM_CMR2			MMIO32(PWM_BASE + 0x240)
/** PWM_CDTY2 PWM Channel Duty Cycle Register (ch_num = 2) **/
#define PWM_CDTY2			MMIO32(PWM_BASE + 0x244)
/** PWM_CDTYUPD2 PWM Channel Duty Cycle Update Register (ch_num = 2) **/
#define PWM_CDTYUPD2			MMIO32(PWM_BASE + 0x248)
/** PWM_CPRD2 PWM Channel Period Register (ch_num = 2) **/
#define PWM_CPRD2			MMIO32(PWM_BASE + 0x24c)
/** PWM_CPRDUPD2 PWM Channel Period Update Register (ch_num = 2) **/
#define PWM_CPRDUPD2			MMIO32(PWM_BASE + 0x250)
/** PWM_CCNT2 PWM Channel Counter Register (ch_num = 2) **/
#define PWM_CCNT2			MMIO32(PWM_BASE + 0x254)
/** PWM_DT2 PWM Channel Dead Time Register (ch_num = 2) **/
#define PWM_DT2			MMIO32(PWM_BASE + 0x258)
/** PWM_DTUPD2 PWM Channel Dead Time Update Register (ch_num = 2) **/
#define PWM_DTUPD2			MMIO32(PWM_BASE + 0x25c)
/** PWM_CMR3 PWM Channel Mode Register (ch_num = 3) **/
#define PWM_CMR3			MMIO32(PWM_BASE + 0x260)
/** PWM_CDTY3 PWM Channel Duty Cycle Register (ch_num = 3) **/
#define PWM_CDTY3			MMIO32(PWM_BASE + 0x264)
/** PWM_CDTYUPD3 PWM Channel Duty Cycle Update Register (ch_num = 3) **/
#define PWM_CDTYUPD3			MMIO32(PWM_BASE + 0x268)
/** PWM_CPRD3 PWM Channel Period Register (ch_num = 3) **/
#define PWM_CPRD3			MMIO32(PWM_BASE + 0x26c)
/** PWM_CPRDUPD3 PWM Channel Period Update Register (ch_num = 3) **/
#define PWM_CPRDUPD3			MMIO32(PWM_BASE + 0x270)
/** PWM_CCNT3 PWM Channel Counter Register (ch_num = 3) **/
#define PWM_CCNT3			MMIO32(PWM_BASE + 0x274)
/** PWM_DT3 PWM Channel Dead Time Register (ch_num = 3) **/
#define PWM_DT3			MMIO32(PWM_BASE + 0x278)
/** PWM_DTUPD3 PWM Channel Dead Time Update Register (ch_num = 3) **/
#define PWM_DTUPD3			MMIO32(PWM_BASE + 0x27c)
/** PWM_CMR4 PWM Channel Mode Register (ch_num = 4) **/
#define PWM_CMR4			MMIO32(PWM_BASE + 0x280)
/** PWM_CDTY4 PWM Channel Duty Cycle Register (ch_num = 4) **/
#define PWM_CDTY4			MMIO32(PWM_BASE + 0x284)
/** PWM_CDTYUPD4 PWM Channel Duty Cycle Update Register (ch_num = 4) **/
#define PWM_CDTYUPD4			MMIO32(PWM_BASE + 0x288)
/** PWM_CPRD4 PWM Channel Period Register (ch_num = 4) **/
#define PWM_CPRD4			MMIO32(PWM_BASE + 0x28c)
/** PWM_CPRDUPD4 PWM Channel Period Update Register (ch_num = 4) **/
#define PWM_CPRDUPD4			MMIO32(PWM_BASE + 0x290)
/** PWM_CCNT4 PWM Channel Counter Register (ch_num = 4) **/
#define PWM_CCNT4			MMIO32(PWM_BASE + 0x294)
/** PWM_DT4 PWM Channel Dead Time Register (ch_num = 4) **/
#define PWM_DT4			MMIO32(PWM_BASE + 0x298)
/** PWM_DTUPD4 PWM Channel Dead Time Update Register (ch_num = 4) **/
#define PWM_DTUPD4			MMIO32(PWM_BASE + 0x29c)
/** PWM_CMR5 PWM Channel Mode Register (ch_num = 5) **/
#define PWM_CMR5			MMIO32(PWM_BASE + 0x2a0)
/** PWM_CDTY5 PWM Channel Duty Cycle Register (ch_num = 5) **/
#define PWM_CDTY5			MMIO32(PWM_BASE + 0x2a4)
/** PWM_CDTYUPD5 PWM Channel Duty Cycle Update Register (ch_num = 5) **/
#define PWM_CDTYUPD5			MMIO32(PWM_BASE + 0x2a8)
/** PWM_CPRD5 PWM Channel Period Register (ch_num = 5) **/
#define PWM_CPRD5			MMIO32(PWM_BASE + 0x2ac)
/** PWM_CPRDUPD5 PWM Channel Period Update Register (ch_num = 5) **/
#define PWM_CPRDUPD5			MMIO32(PWM_BASE + 0x2b0)
/** PWM_CCNT5 PWM Channel Counter Register (ch_num = 5) **/
#define PWM_CCNT5			MMIO32(PWM_BASE + 0x2b4)
/** PWM_DT5 PWM Channel Dead Time Register (ch_num = 5) **/
#define PWM_DT5			MMIO32(PWM_BASE + 0x2b8)
/** PWM_DTUPD5 PWM Channel Dead Time Update Register (ch_num = 5) **/
#define PWM_DTUPD5			MMIO32(PWM_BASE + 0x2bc)
/** PWM_CMR6 PWM Channel Mode Register (ch_num = 6) **/
#define PWM_CMR6			MMIO32(PWM_BASE + 0x2c0)
/** PWM_CDTY6 PWM Channel Duty Cycle Register (ch_num = 6) **/
#define PWM_CDTY6			MMIO32(PWM_BASE + 0x2c4)
/** PWM_CDTYUPD6 PWM Channel Duty Cycle Update Register (ch_num = 6) **/
#define PWM_CDTYUPD6			MMIO32(PWM_BASE + 0x2c8)
/** PWM_CPRD6 PWM Channel Period Register (ch_num = 6) **/
#define PWM_CPRD6			MMIO32(PWM_BASE + 0x2cc)
/** PWM_CPRDUPD6 PWM Channel Period Update Register (ch_num = 6) **/
#define PWM_CPRDUPD6			MMIO32(PWM_BASE + 0x2d0)
/** PWM_CCNT6 PWM Channel Counter Register (ch_num = 6) **/
#define PWM_CCNT6			MMIO32(PWM_BASE + 0x2d4)
/** PWM_DT6 PWM Channel Dead Time Register (ch_num = 6) **/
#define PWM_DT6			MMIO32(PWM_BASE + 0x2d8)
/** PWM_DTUPD6 PWM Channel Dead Time Update Register (ch_num = 6) **/
#define PWM_DTUPD6			MMIO32(PWM_BASE + 0x2dc)
/** PWM_CMR7 PWM Channel Mode Register (ch_num = 7) **/
#define PWM_CMR7			MMIO32(PWM_BASE + 0x2e0)
/** PWM_CDTY7 PWM Channel Duty Cycle Register (ch_num = 7) **/
#define PWM_CDTY7			MMIO32(PWM_BASE + 0x2e4)
/** PWM_CDTYUPD7 PWM Channel Duty Cycle Update Register (ch_num = 7) **/
#define PWM_CDTYUPD7			MMIO32(PWM_BASE + 0x2e8)
/** PWM_CPRD7 PWM Channel Period Register (ch_num = 7) **/
#define PWM_CPRD7			MMIO32(PWM_BASE + 0x2ec)
/** PWM_CPRDUPD7 PWM Channel Period Update Register (ch_num = 7) **/
#define PWM_CPRDUPD7			MMIO32(PWM_BASE + 0x2f0)
/** PWM_CCNT7 PWM Channel Counter Register (ch_num = 7) **/
#define PWM_CCNT7			MMIO32(PWM_BASE + 0x2f4)
/** PWM_DT7 PWM Channel Dead Time Register (ch_num = 7) **/
#define PWM_DT7			MMIO32(PWM_BASE + 0x2f8)
/** PWM_DTUPD7 PWM Channel Dead Time Update Register (ch_num = 7) **/
#define PWM_DTUPD7			MMIO32(PWM_BASE + 0x2fc)

/**@}*/


/** @defgroup pwm_clk CLK PWM Clock Register
@{*/


#define PWM_CLK_PREB_SHIFT		24
#define PWM_CLK_PREB_MASK		0x0f
/** @defgroup pwm_clk_preb PREB CLKA, CLKB Source Clock Selection
@{*/
/**@}*/


#define PWM_CLK_DIVB_SHIFT		16
#define PWM_CLK_DIVB_MASK		0xff
/** @defgroup pwm_clk_divb DIVB CLKA, CLKB Divide Factor
@{*/
/**@}*/


#define PWM_CLK_PREA_SHIFT		8
#define PWM_CLK_PREA_MASK		0x0f
/** @defgroup pwm_clk_prea PREA CLKA, CLKB Source Clock Selection
@{*/
/**@}*/


#define PWM_CLK_DIVA_SHIFT		0
#define PWM_CLK_DIVA_MASK		0xff
/** @defgroup pwm_clk_diva DIVA CLKA, CLKB Divide Factor
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ena ENA PWM Enable Register
@{*/

/** PWM_ENA_CHID7 Channel ID **/
#define PWM_ENA_CHID7		(1 << 7)
/** PWM_ENA_CHID6 Channel ID **/
#define PWM_ENA_CHID6		(1 << 6)
/** PWM_ENA_CHID5 Channel ID **/
#define PWM_ENA_CHID5		(1 << 5)
/** PWM_ENA_CHID4 Channel ID **/
#define PWM_ENA_CHID4		(1 << 4)
/** PWM_ENA_CHID3 Channel ID **/
#define PWM_ENA_CHID3		(1 << 3)
/** PWM_ENA_CHID2 Channel ID **/
#define PWM_ENA_CHID2		(1 << 2)
/** PWM_ENA_CHID1 Channel ID **/
#define PWM_ENA_CHID1		(1 << 1)
/** PWM_ENA_CHID0 Channel ID **/
#define PWM_ENA_CHID0		(1 << 0)

/**@}*/

