grevaillot/svd_tools/headers/ATSAM3X8H/pwm.h
/** @defgroup pwm_dis DIS PWM Disable Register
@{*/

/** PWM_DIS_CHID7 Channel ID **/
#define PWM_DIS_CHID7		(1 << 7)
/** PWM_DIS_CHID6 Channel ID **/
#define PWM_DIS_CHID6		(1 << 6)
/** PWM_DIS_CHID5 Channel ID **/
#define PWM_DIS_CHID5		(1 << 5)
/** PWM_DIS_CHID4 Channel ID **/
#define PWM_DIS_CHID4		(1 << 4)
/** PWM_DIS_CHID3 Channel ID **/
#define PWM_DIS_CHID3		(1 << 3)
/** PWM_DIS_CHID2 Channel ID **/
#define PWM_DIS_CHID2		(1 << 2)
/** PWM_DIS_CHID1 Channel ID **/
#define PWM_DIS_CHID1		(1 << 1)
/** PWM_DIS_CHID0 Channel ID **/
#define PWM_DIS_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm_sr SR PWM Status Register
@{*/

/** PWM_SR_CHID7 Channel ID **/
#define PWM_SR_CHID7		(1 << 7)
/** PWM_SR_CHID6 Channel ID **/
#define PWM_SR_CHID6		(1 << 6)
/** PWM_SR_CHID5 Channel ID **/
#define PWM_SR_CHID5		(1 << 5)
/** PWM_SR_CHID4 Channel ID **/
#define PWM_SR_CHID4		(1 << 4)
/** PWM_SR_CHID3 Channel ID **/
#define PWM_SR_CHID3		(1 << 3)
/** PWM_SR_CHID2 Channel ID **/
#define PWM_SR_CHID2		(1 << 2)
/** PWM_SR_CHID1 Channel ID **/
#define PWM_SR_CHID1		(1 << 1)
/** PWM_SR_CHID0 Channel ID **/
#define PWM_SR_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm_ier1 IER1 PWM Interrupt Enable Register 1
@{*/

/** PWM_IER1_FCHID7 Fault Protection Trigger on Channel 7 Interrupt Enable **/
#define PWM_IER1_FCHID7		(1 << 23)
/** PWM_IER1_FCHID6 Fault Protection Trigger on Channel 6 Interrupt Enable **/
#define PWM_IER1_FCHID6		(1 << 22)
/** PWM_IER1_FCHID5 Fault Protection Trigger on Channel 5 Interrupt Enable **/
#define PWM_IER1_FCHID5		(1 << 21)
/** PWM_IER1_FCHID4 Fault Protection Trigger on Channel 4 Interrupt Enable **/
#define PWM_IER1_FCHID4		(1 << 20)
/** PWM_IER1_FCHID3 Fault Protection Trigger on Channel 3 Interrupt Enable **/
#define PWM_IER1_FCHID3		(1 << 19)
/** PWM_IER1_FCHID2 Fault Protection Trigger on Channel 2 Interrupt Enable **/
#define PWM_IER1_FCHID2		(1 << 18)
/** PWM_IER1_FCHID1 Fault Protection Trigger on Channel 1 Interrupt Enable **/
#define PWM_IER1_FCHID1		(1 << 17)
/** PWM_IER1_FCHID0 Fault Protection Trigger on Channel 0 Interrupt Enable **/
#define PWM_IER1_FCHID0		(1 << 16)
/** PWM_IER1_CHID7 Counter Event on Channel 7 Interrupt Enable **/
#define PWM_IER1_CHID7		(1 << 7)
/** PWM_IER1_CHID6 Counter Event on Channel 6 Interrupt Enable **/
#define PWM_IER1_CHID6		(1 << 6)
/** PWM_IER1_CHID5 Counter Event on Channel 5 Interrupt Enable **/
#define PWM_IER1_CHID5		(1 << 5)
/** PWM_IER1_CHID4 Counter Event on Channel 4 Interrupt Enable **/
#define PWM_IER1_CHID4		(1 << 4)
/** PWM_IER1_CHID3 Counter Event on Channel 3 Interrupt Enable **/
#define PWM_IER1_CHID3		(1 << 3)
/** PWM_IER1_CHID2 Counter Event on Channel 2 Interrupt Enable **/
#define PWM_IER1_CHID2		(1 << 2)
/** PWM_IER1_CHID1 Counter Event on Channel 1 Interrupt Enable **/
#define PWM_IER1_CHID1		(1 << 1)
/** PWM_IER1_CHID0 Counter Event on Channel 0 Interrupt Enable **/
#define PWM_IER1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm_idr1 IDR1 PWM Interrupt Disable Register 1
@{*/

/** PWM_IDR1_FCHID7 Fault Protection Trigger on Channel 7 Interrupt Disable **/
#define PWM_IDR1_FCHID7		(1 << 23)
/** PWM_IDR1_FCHID6 Fault Protection Trigger on Channel 6 Interrupt Disable **/
#define PWM_IDR1_FCHID6		(1 << 22)
/** PWM_IDR1_FCHID5 Fault Protection Trigger on Channel 5 Interrupt Disable **/
#define PWM_IDR1_FCHID5		(1 << 21)
/** PWM_IDR1_FCHID4 Fault Protection Trigger on Channel 4 Interrupt Disable **/
#define PWM_IDR1_FCHID4		(1 << 20)
/** PWM_IDR1_FCHID3 Fault Protection Trigger on Channel 3 Interrupt Disable **/
#define PWM_IDR1_FCHID3		(1 << 19)
/** PWM_IDR1_FCHID2 Fault Protection Trigger on Channel 2 Interrupt Disable **/
#define PWM_IDR1_FCHID2		(1 << 18)
/** PWM_IDR1_FCHID1 Fault Protection Trigger on Channel 1 Interrupt Disable **/
#define PWM_IDR1_FCHID1		(1 << 17)
/** PWM_IDR1_FCHID0 Fault Protection Trigger on Channel 0 Interrupt Disable **/
#define PWM_IDR1_FCHID0		(1 << 16)
/** PWM_IDR1_CHID7 Counter Event on Channel 7 Interrupt Disable **/
#define PWM_IDR1_CHID7		(1 << 7)
/** PWM_IDR1_CHID6 Counter Event on Channel 6 Interrupt Disable **/
#define PWM_IDR1_CHID6		(1 << 6)
/** PWM_IDR1_CHID5 Counter Event on Channel 5 Interrupt Disable **/
#define PWM_IDR1_CHID5		(1 << 5)
/** PWM_IDR1_CHID4 Counter Event on Channel 4 Interrupt Disable **/
#define PWM_IDR1_CHID4		(1 << 4)
/** PWM_IDR1_CHID3 Counter Event on Channel 3 Interrupt Disable **/
#define PWM_IDR1_CHID3		(1 << 3)
/** PWM_IDR1_CHID2 Counter Event on Channel 2 Interrupt Disable **/
#define PWM_IDR1_CHID2		(1 << 2)
/** PWM_IDR1_CHID1 Counter Event on Channel 1 Interrupt Disable **/
#define PWM_IDR1_CHID1		(1 << 1)
/** PWM_IDR1_CHID0 Counter Event on Channel 0 Interrupt Disable **/
#define PWM_IDR1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm_imr1 IMR1 PWM Interrupt Mask Register 1
@{*/

/** PWM_IMR1_FCHID7 Fault Protection Trigger on Channel 7 Interrupt Mask **/
#define PWM_IMR1_FCHID7		(1 << 23)
/** PWM_IMR1_FCHID6 Fault Protection Trigger on Channel 6 Interrupt Mask **/
#define PWM_IMR1_FCHID6		(1 << 22)
/** PWM_IMR1_FCHID5 Fault Protection Trigger on Channel 5 Interrupt Mask **/
#define PWM_IMR1_FCHID5		(1 << 21)
/** PWM_IMR1_FCHID4 Fault Protection Trigger on Channel 4 Interrupt Mask **/
#define PWM_IMR1_FCHID4		(1 << 20)
/** PWM_IMR1_FCHID3 Fault Protection Trigger on Channel 3 Interrupt Mask **/
#define PWM_IMR1_FCHID3		(1 << 19)
/** PWM_IMR1_FCHID2 Fault Protection Trigger on Channel 2 Interrupt Mask **/
#define PWM_IMR1_FCHID2		(1 << 18)
/** PWM_IMR1_FCHID1 Fault Protection Trigger on Channel 1 Interrupt Mask **/
#define PWM_IMR1_FCHID1		(1 << 17)
/** PWM_IMR1_FCHID0 Fault Protection Trigger on Channel 0 Interrupt Mask **/
#define PWM_IMR1_FCHID0		(1 << 16)
/** PWM_IMR1_CHID7 Counter Event on Channel 7 Interrupt Mask **/
#define PWM_IMR1_CHID7		(1 << 7)
/** PWM_IMR1_CHID6 Counter Event on Channel 6 Interrupt Mask **/
#define PWM_IMR1_CHID6		(1 << 6)
/** PWM_IMR1_CHID5 Counter Event on Channel 5 Interrupt Mask **/
#define PWM_IMR1_CHID5		(1 << 5)
/** PWM_IMR1_CHID4 Counter Event on Channel 4 Interrupt Mask **/
#define PWM_IMR1_CHID4		(1 << 4)
/** PWM_IMR1_CHID3 Counter Event on Channel 3 Interrupt Mask **/
#define PWM_IMR1_CHID3		(1 << 3)
/** PWM_IMR1_CHID2 Counter Event on Channel 2 Interrupt Mask **/
#define PWM_IMR1_CHID2		(1 << 2)
/** PWM_IMR1_CHID1 Counter Event on Channel 1 Interrupt Mask **/
#define PWM_IMR1_CHID1		(1 << 1)
/** PWM_IMR1_CHID0 Counter Event on Channel 0 Interrupt Mask **/
#define PWM_IMR1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm_isr1 ISR1 PWM Interrupt Status Register 1
@{*/

/** PWM_ISR1_FCHID7 Fault Protection Trigger on Channel 7 **/
#define PWM_ISR1_FCHID7		(1 << 23)
/** PWM_ISR1_FCHID6 Fault Protection Trigger on Channel 6 **/
#define PWM_ISR1_FCHID6		(1 << 22)
/** PWM_ISR1_FCHID5 Fault Protection Trigger on Channel 5 **/
#define PWM_ISR1_FCHID5		(1 << 21)
/** PWM_ISR1_FCHID4 Fault Protection Trigger on Channel 4 **/
#define PWM_ISR1_FCHID4		(1 << 20)
/** PWM_ISR1_FCHID3 Fault Protection Trigger on Channel 3 **/
#define PWM_ISR1_FCHID3		(1 << 19)
/** PWM_ISR1_FCHID2 Fault Protection Trigger on Channel 2 **/
#define PWM_ISR1_FCHID2		(1 << 18)
/** PWM_ISR1_FCHID1 Fault Protection Trigger on Channel 1 **/
#define PWM_ISR1_FCHID1		(1 << 17)
/** PWM_ISR1_FCHID0 Fault Protection Trigger on Channel 0 **/
#define PWM_ISR1_FCHID0		(1 << 16)
/** PWM_ISR1_CHID7 Counter Event on Channel 7 **/
#define PWM_ISR1_CHID7		(1 << 7)
/** PWM_ISR1_CHID6 Counter Event on Channel 6 **/
#define PWM_ISR1_CHID6		(1 << 6)
/** PWM_ISR1_CHID5 Counter Event on Channel 5 **/
#define PWM_ISR1_CHID5		(1 << 5)
/** PWM_ISR1_CHID4 Counter Event on Channel 4 **/
#define PWM_ISR1_CHID4		(1 << 4)
/** PWM_ISR1_CHID3 Counter Event on Channel 3 **/
#define PWM_ISR1_CHID3		(1 << 3)
/** PWM_ISR1_CHID2 Counter Event on Channel 2 **/
#define PWM_ISR1_CHID2		(1 << 2)
/** PWM_ISR1_CHID1 Counter Event on Channel 1 **/
#define PWM_ISR1_CHID1		(1 << 1)
/** PWM_ISR1_CHID0 Counter Event on Channel 0 **/
#define PWM_ISR1_CHID0		(1 << 0)

/**@}*/

