grevaillot/svd_tools/headers/ATSAM3X8H/pwm.h
/** @defgroup pwm_scm SCM PWM Sync Channels Mode Register
@{*/


#define PWM_SCM_PTRCS_SHIFT		21
#define PWM_SCM_PTRCS_MASK		0x07
/** @defgroup pwm_scm_ptrcs PTRCS PDC Transfer Request Comparison Selection
@{*/
/**@}*/

/** PWM_SCM_PTRM PDC Transfer Request Mode **/
#define PWM_SCM_PTRM		(1 << 20)

#define PWM_SCM_UPDM_SHIFT		16
#define PWM_SCM_UPDM_MASK		0x03
/** @defgroup pwm_scm_updm UPDM Synchronous Channels Update Mode
@{*/
/**@}*/

/** PWM_SCM_SYNC7 Synchronous Channel 7 **/
#define PWM_SCM_SYNC7		(1 << 7)
/** PWM_SCM_SYNC6 Synchronous Channel 6 **/
#define PWM_SCM_SYNC6		(1 << 6)
/** PWM_SCM_SYNC5 Synchronous Channel 5 **/
#define PWM_SCM_SYNC5		(1 << 5)
/** PWM_SCM_SYNC4 Synchronous Channel 4 **/
#define PWM_SCM_SYNC4		(1 << 4)
/** PWM_SCM_SYNC3 Synchronous Channel 3 **/
#define PWM_SCM_SYNC3		(1 << 3)
/** PWM_SCM_SYNC2 Synchronous Channel 2 **/
#define PWM_SCM_SYNC2		(1 << 2)
/** PWM_SCM_SYNC1 Synchronous Channel 1 **/
#define PWM_SCM_SYNC1		(1 << 1)
/** PWM_SCM_SYNC0 Synchronous Channel 0 **/
#define PWM_SCM_SYNC0		(1 << 0)

/**@}*/

/** @defgroup pwm_scuc SCUC PWM Sync Channels Update Control Register
@{*/

/** PWM_SCUC_UPDULOCK Synchronous Channels Update Unlock **/
#define PWM_SCUC_UPDULOCK		(1 << 0)

/**@}*/

/** @defgroup pwm_scup SCUP PWM Sync Channels Update Period Register
@{*/


#define PWM_SCUP_UPRCNT_SHIFT		4
#define PWM_SCUP_UPRCNT_MASK		0x0f
/** @defgroup pwm_scup_uprcnt UPRCNT Update Period Counter
@{*/
/**@}*/


#define PWM_SCUP_UPR_SHIFT		0
#define PWM_SCUP_UPR_MASK		0x0f
/** @defgroup pwm_scup_upr UPR Update Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_scupupd SCUPUPD PWM Sync Channels Update Period Update Register
@{*/


#define PWM_SCUPUPD_UPRUPD_SHIFT		0
#define PWM_SCUPUPD_UPRUPD_MASK		0x0f
/** @defgroup pwm_scupupd_uprupd UPRUPD Update Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ier2 IER2 PWM Interrupt Enable Register 2
@{*/

/** PWM_IER2_CMPU7 Comparison 7 Update Interrupt Enable **/
#define PWM_IER2_CMPU7		(1 << 23)
/** PWM_IER2_CMPU6 Comparison 6 Update Interrupt Enable **/
#define PWM_IER2_CMPU6		(1 << 22)
/** PWM_IER2_CMPU5 Comparison 5 Update Interrupt Enable **/
#define PWM_IER2_CMPU5		(1 << 21)
/** PWM_IER2_CMPU4 Comparison 4 Update Interrupt Enable **/
#define PWM_IER2_CMPU4		(1 << 20)
/** PWM_IER2_CMPU3 Comparison 3 Update Interrupt Enable **/
#define PWM_IER2_CMPU3		(1 << 19)
/** PWM_IER2_CMPU2 Comparison 2 Update Interrupt Enable **/
#define PWM_IER2_CMPU2		(1 << 18)
/** PWM_IER2_CMPU1 Comparison 1 Update Interrupt Enable **/
#define PWM_IER2_CMPU1		(1 << 17)
/** PWM_IER2_CMPU0 Comparison 0 Update Interrupt Enable **/
#define PWM_IER2_CMPU0		(1 << 16)
/** PWM_IER2_CMPM7 Comparison 7 Match Interrupt Enable **/
#define PWM_IER2_CMPM7		(1 << 15)
/** PWM_IER2_CMPM6 Comparison 6 Match Interrupt Enable **/
#define PWM_IER2_CMPM6		(1 << 14)
/** PWM_IER2_CMPM5 Comparison 5 Match Interrupt Enable **/
#define PWM_IER2_CMPM5		(1 << 13)
/** PWM_IER2_CMPM4 Comparison 4 Match Interrupt Enable **/
#define PWM_IER2_CMPM4		(1 << 12)
/** PWM_IER2_CMPM3 Comparison 3 Match Interrupt Enable **/
#define PWM_IER2_CMPM3		(1 << 11)
/** PWM_IER2_CMPM2 Comparison 2 Match Interrupt Enable **/
#define PWM_IER2_CMPM2		(1 << 10)
/** PWM_IER2_CMPM1 Comparison 1 Match Interrupt Enable **/
#define PWM_IER2_CMPM1		(1 << 9)
/** PWM_IER2_CMPM0 Comparison 0 Match Interrupt Enable **/
#define PWM_IER2_CMPM0		(1 << 8)
/** PWM_IER2_UNRE Synchronous Channels Update Underrun Error Interrupt Enable **/
#define PWM_IER2_UNRE		(1 << 3)
/** PWM_IER2_TXBUFE PDC TX Buffer Empty Interrupt Enable **/
#define PWM_IER2_TXBUFE		(1 << 2)
/** PWM_IER2_ENDTX PDC End of TX Buffer Interrupt Enable **/
#define PWM_IER2_ENDTX		(1 << 1)
/** PWM_IER2_WRDY Write Ready for Synchronous Channels Update Interrupt Enable **/
#define PWM_IER2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm_idr2 IDR2 PWM Interrupt Disable Register 2
@{*/

/** PWM_IDR2_CMPU7 Comparison 7 Update Interrupt Disable **/
#define PWM_IDR2_CMPU7		(1 << 23)
/** PWM_IDR2_CMPU6 Comparison 6 Update Interrupt Disable **/
#define PWM_IDR2_CMPU6		(1 << 22)
/** PWM_IDR2_CMPU5 Comparison 5 Update Interrupt Disable **/
#define PWM_IDR2_CMPU5		(1 << 21)
/** PWM_IDR2_CMPU4 Comparison 4 Update Interrupt Disable **/
#define PWM_IDR2_CMPU4		(1 << 20)
/** PWM_IDR2_CMPU3 Comparison 3 Update Interrupt Disable **/
#define PWM_IDR2_CMPU3		(1 << 19)
/** PWM_IDR2_CMPU2 Comparison 2 Update Interrupt Disable **/
#define PWM_IDR2_CMPU2		(1 << 18)
/** PWM_IDR2_CMPU1 Comparison 1 Update Interrupt Disable **/
#define PWM_IDR2_CMPU1		(1 << 17)
/** PWM_IDR2_CMPU0 Comparison 0 Update Interrupt Disable **/
#define PWM_IDR2_CMPU0		(1 << 16)
/** PWM_IDR2_CMPM7 Comparison 7 Match Interrupt Disable **/
#define PWM_IDR2_CMPM7		(1 << 15)
/** PWM_IDR2_CMPM6 Comparison 6 Match Interrupt Disable **/
#define PWM_IDR2_CMPM6		(1 << 14)
/** PWM_IDR2_CMPM5 Comparison 5 Match Interrupt Disable **/
#define PWM_IDR2_CMPM5		(1 << 13)
/** PWM_IDR2_CMPM4 Comparison 4 Match Interrupt Disable **/
#define PWM_IDR2_CMPM4		(1 << 12)
/** PWM_IDR2_CMPM3 Comparison 3 Match Interrupt Disable **/
#define PWM_IDR2_CMPM3		(1 << 11)
/** PWM_IDR2_CMPM2 Comparison 2 Match Interrupt Disable **/
#define PWM_IDR2_CMPM2		(1 << 10)
/** PWM_IDR2_CMPM1 Comparison 1 Match Interrupt Disable **/
#define PWM_IDR2_CMPM1		(1 << 9)
/** PWM_IDR2_CMPM0 Comparison 0 Match Interrupt Disable **/
#define PWM_IDR2_CMPM0		(1 << 8)
/** PWM_IDR2_UNRE Synchronous Channels Update Underrun Error Interrupt Disable **/
#define PWM_IDR2_UNRE		(1 << 3)
/** PWM_IDR2_TXBUFE PDC TX Buffer Empty Interrupt Disable **/
#define PWM_IDR2_TXBUFE		(1 << 2)
/** PWM_IDR2_ENDTX PDC End of TX Buffer Interrupt Disable **/
#define PWM_IDR2_ENDTX		(1 << 1)
/** PWM_IDR2_WRDY Write Ready for Synchronous Channels Update Interrupt Disable **/
#define PWM_IDR2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm_imr2 IMR2 PWM Interrupt Mask Register 2
@{*/

/** PWM_IMR2_CMPU7 Comparison 7 Update Interrupt Mask **/
#define PWM_IMR2_CMPU7		(1 << 23)
/** PWM_IMR2_CMPU6 Comparison 6 Update Interrupt Mask **/
#define PWM_IMR2_CMPU6		(1 << 22)
/** PWM_IMR2_CMPU5 Comparison 5 Update Interrupt Mask **/
#define PWM_IMR2_CMPU5		(1 << 21)
/** PWM_IMR2_CMPU4 Comparison 4 Update Interrupt Mask **/
#define PWM_IMR2_CMPU4		(1 << 20)
/** PWM_IMR2_CMPU3 Comparison 3 Update Interrupt Mask **/
#define PWM_IMR2_CMPU3		(1 << 19)
/** PWM_IMR2_CMPU2 Comparison 2 Update Interrupt Mask **/
#define PWM_IMR2_CMPU2		(1 << 18)
/** PWM_IMR2_CMPU1 Comparison 1 Update Interrupt Mask **/
#define PWM_IMR2_CMPU1		(1 << 17)
/** PWM_IMR2_CMPU0 Comparison 0 Update Interrupt Mask **/
#define PWM_IMR2_CMPU0		(1 << 16)
/** PWM_IMR2_CMPM7 Comparison 7 Match Interrupt Mask **/
#define PWM_IMR2_CMPM7		(1 << 15)
/** PWM_IMR2_CMPM6 Comparison 6 Match Interrupt Mask **/
#define PWM_IMR2_CMPM6		(1 << 14)
/** PWM_IMR2_CMPM5 Comparison 5 Match Interrupt Mask **/
#define PWM_IMR2_CMPM5		(1 << 13)
/** PWM_IMR2_CMPM4 Comparison 4 Match Interrupt Mask **/
#define PWM_IMR2_CMPM4		(1 << 12)
/** PWM_IMR2_CMPM3 Comparison 3 Match Interrupt Mask **/
#define PWM_IMR2_CMPM3		(1 << 11)
/** PWM_IMR2_CMPM2 Comparison 2 Match Interrupt Mask **/
#define PWM_IMR2_CMPM2		(1 << 10)
/** PWM_IMR2_CMPM1 Comparison 1 Match Interrupt Mask **/
#define PWM_IMR2_CMPM1		(1 << 9)
/** PWM_IMR2_CMPM0 Comparison 0 Match Interrupt Mask **/
#define PWM_IMR2_CMPM0		(1 << 8)
/** PWM_IMR2_UNRE Synchronous Channels Update Underrun Error Interrupt Mask **/
#define PWM_IMR2_UNRE		(1 << 3)
/** PWM_IMR2_TXBUFE PDC TX Buffer Empty Interrupt Mask **/
#define PWM_IMR2_TXBUFE		(1 << 2)
/** PWM_IMR2_ENDTX PDC End of TX Buffer Interrupt Mask **/
#define PWM_IMR2_ENDTX		(1 << 1)
/** PWM_IMR2_WRDY Write Ready for Synchronous Channels Update Interrupt Mask **/
#define PWM_IMR2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm_isr2 ISR2 PWM Interrupt Status Register 2
@{*/

/** PWM_ISR2_CMPU7 Comparison 7 Update **/
#define PWM_ISR2_CMPU7		(1 << 23)
/** PWM_ISR2_CMPU6 Comparison 6 Update **/
#define PWM_ISR2_CMPU6		(1 << 22)
/** PWM_ISR2_CMPU5 Comparison 5 Update **/
#define PWM_ISR2_CMPU5		(1 << 21)
/** PWM_ISR2_CMPU4 Comparison 4 Update **/
#define PWM_ISR2_CMPU4		(1 << 20)
/** PWM_ISR2_CMPU3 Comparison 3 Update **/
#define PWM_ISR2_CMPU3		(1 << 19)
/** PWM_ISR2_CMPU2 Comparison 2 Update **/
#define PWM_ISR2_CMPU2		(1 << 18)
/** PWM_ISR2_CMPU1 Comparison 1 Update **/
#define PWM_ISR2_CMPU1		(1 << 17)
/** PWM_ISR2_CMPU0 Comparison 0 Update **/
#define PWM_ISR2_CMPU0		(1 << 16)
/** PWM_ISR2_CMPM7 Comparison 7 Match **/
#define PWM_ISR2_CMPM7		(1 << 15)
/** PWM_ISR2_CMPM6 Comparison 6 Match **/
#define PWM_ISR2_CMPM6		(1 << 14)
/** PWM_ISR2_CMPM5 Comparison 5 Match **/
#define PWM_ISR2_CMPM5		(1 << 13)
/** PWM_ISR2_CMPM4 Comparison 4 Match **/
#define PWM_ISR2_CMPM4		(1 << 12)
/** PWM_ISR2_CMPM3 Comparison 3 Match **/
#define PWM_ISR2_CMPM3		(1 << 11)
/** PWM_ISR2_CMPM2 Comparison 2 Match **/
#define PWM_ISR2_CMPM2		(1 << 10)
/** PWM_ISR2_CMPM1 Comparison 1 Match **/
#define PWM_ISR2_CMPM1		(1 << 9)
/** PWM_ISR2_CMPM0 Comparison 0 Match **/
#define PWM_ISR2_CMPM0		(1 << 8)
/** PWM_ISR2_UNRE Synchronous Channels Update Underrun Error **/
#define PWM_ISR2_UNRE		(1 << 3)
/** PWM_ISR2_TXBUFE PDC TX Buffer Empty **/
#define PWM_ISR2_TXBUFE		(1 << 2)
/** PWM_ISR2_ENDTX PDC End of TX Buffer **/
#define PWM_ISR2_ENDTX		(1 << 1)
/** PWM_ISR2_WRDY Write Ready for Synchronous Channels Update **/
#define PWM_ISR2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm_oov OOV PWM Output Override Value Register
@{*/

/** PWM_OOV_OOVL7 Output Override Value for PWML output of the channel 7 **/
#define PWM_OOV_OOVL7		(1 << 23)
/** PWM_OOV_OOVL6 Output Override Value for PWML output of the channel 6 **/
#define PWM_OOV_OOVL6		(1 << 22)
/** PWM_OOV_OOVL5 Output Override Value for PWML output of the channel 5 **/
#define PWM_OOV_OOVL5		(1 << 21)
/** PWM_OOV_OOVL4 Output Override Value for PWML output of the channel 4 **/
#define PWM_OOV_OOVL4		(1 << 20)
/** PWM_OOV_OOVL3 Output Override Value for PWML output of the channel 3 **/
#define PWM_OOV_OOVL3		(1 << 19)
/** PWM_OOV_OOVL2 Output Override Value for PWML output of the channel 2 **/
#define PWM_OOV_OOVL2		(1 << 18)
/** PWM_OOV_OOVL1 Output Override Value for PWML output of the channel 1 **/
#define PWM_OOV_OOVL1		(1 << 17)
/** PWM_OOV_OOVL0 Output Override Value for PWML output of the channel 0 **/
#define PWM_OOV_OOVL0		(1 << 16)
/** PWM_OOV_OOVH7 Output Override Value for PWMH output of the channel 7 **/
#define PWM_OOV_OOVH7		(1 << 7)
/** PWM_OOV_OOVH6 Output Override Value for PWMH output of the channel 6 **/
#define PWM_OOV_OOVH6		(1 << 6)
/** PWM_OOV_OOVH5 Output Override Value for PWMH output of the channel 5 **/
#define PWM_OOV_OOVH5		(1 << 5)
/** PWM_OOV_OOVH4 Output Override Value for PWMH output of the channel 4 **/
#define PWM_OOV_OOVH4		(1 << 4)
/** PWM_OOV_OOVH3 Output Override Value for PWMH output of the channel 3 **/
#define PWM_OOV_OOVH3		(1 << 3)
/** PWM_OOV_OOVH2 Output Override Value for PWMH output of the channel 2 **/
#define PWM_OOV_OOVH2		(1 << 2)
/** PWM_OOV_OOVH1 Output Override Value for PWMH output of the channel 1 **/
#define PWM_OOV_OOVH1		(1 << 1)
/** PWM_OOV_OOVH0 Output Override Value for PWMH output of the channel 0 **/
#define PWM_OOV_OOVH0		(1 << 0)

/**@}*/

/** @defgroup pwm_os OS PWM Output Selection Register
@{*/

/** PWM_OS_OSL7 Output Selection for PWML output of the channel 7 **/
#define PWM_OS_OSL7		(1 << 23)
/** PWM_OS_OSL6 Output Selection for PWML output of the channel 6 **/
#define PWM_OS_OSL6		(1 << 22)
/** PWM_OS_OSL5 Output Selection for PWML output of the channel 5 **/
#define PWM_OS_OSL5		(1 << 21)
/** PWM_OS_OSL4 Output Selection for PWML output of the channel 4 **/
#define PWM_OS_OSL4		(1 << 20)
/** PWM_OS_OSL3 Output Selection for PWML output of the channel 3 **/
#define PWM_OS_OSL3		(1 << 19)
/** PWM_OS_OSL2 Output Selection for PWML output of the channel 2 **/
#define PWM_OS_OSL2		(1 << 18)
/** PWM_OS_OSL1 Output Selection for PWML output of the channel 1 **/
#define PWM_OS_OSL1		(1 << 17)
/** PWM_OS_OSL0 Output Selection for PWML output of the channel 0 **/
#define PWM_OS_OSL0		(1 << 16)
/** PWM_OS_OSH7 Output Selection for PWMH output of the channel 7 **/
#define PWM_OS_OSH7		(1 << 7)
/** PWM_OS_OSH6 Output Selection for PWMH output of the channel 6 **/
#define PWM_OS_OSH6		(1 << 6)
/** PWM_OS_OSH5 Output Selection for PWMH output of the channel 5 **/
#define PWM_OS_OSH5		(1 << 5)
/** PWM_OS_OSH4 Output Selection for PWMH output of the channel 4 **/
#define PWM_OS_OSH4		(1 << 4)
/** PWM_OS_OSH3 Output Selection for PWMH output of the channel 3 **/
#define PWM_OS_OSH3		(1 << 3)
/** PWM_OS_OSH2 Output Selection for PWMH output of the channel 2 **/
#define PWM_OS_OSH2		(1 << 2)
/** PWM_OS_OSH1 Output Selection for PWMH output of the channel 1 **/
#define PWM_OS_OSH1		(1 << 1)
/** PWM_OS_OSH0 Output Selection for PWMH output of the channel 0 **/
#define PWM_OS_OSH0		(1 << 0)

/**@}*/

/** @defgroup pwm_oss OSS PWM Output Selection Set Register
@{*/

/** PWM_OSS_OSSL7 Output Selection Set for PWML output of the channel 7 **/
#define PWM_OSS_OSSL7		(1 << 23)
/** PWM_OSS_OSSL6 Output Selection Set for PWML output of the channel 6 **/
#define PWM_OSS_OSSL6		(1 << 22)
/** PWM_OSS_OSSL5 Output Selection Set for PWML output of the channel 5 **/
#define PWM_OSS_OSSL5		(1 << 21)
/** PWM_OSS_OSSL4 Output Selection Set for PWML output of the channel 4 **/
#define PWM_OSS_OSSL4		(1 << 20)
/** PWM_OSS_OSSL3 Output Selection Set for PWML output of the channel 3 **/
#define PWM_OSS_OSSL3		(1 << 19)
/** PWM_OSS_OSSL2 Output Selection Set for PWML output of the channel 2 **/
#define PWM_OSS_OSSL2		(1 << 18)
/** PWM_OSS_OSSL1 Output Selection Set for PWML output of the channel 1 **/
#define PWM_OSS_OSSL1		(1 << 17)
/** PWM_OSS_OSSL0 Output Selection Set for PWML output of the channel 0 **/
#define PWM_OSS_OSSL0		(1 << 16)
/** PWM_OSS_OSSH7 Output Selection Set for PWMH output of the channel 7 **/
#define PWM_OSS_OSSH7		(1 << 7)
/** PWM_OSS_OSSH6 Output Selection Set for PWMH output of the channel 6 **/
#define PWM_OSS_OSSH6		(1 << 6)
/** PWM_OSS_OSSH5 Output Selection Set for PWMH output of the channel 5 **/
#define PWM_OSS_OSSH5		(1 << 5)
/** PWM_OSS_OSSH4 Output Selection Set for PWMH output of the channel 4 **/
#define PWM_OSS_OSSH4		(1 << 4)
/** PWM_OSS_OSSH3 Output Selection Set for PWMH output of the channel 3 **/
#define PWM_OSS_OSSH3		(1 << 3)
/** PWM_OSS_OSSH2 Output Selection Set for PWMH output of the channel 2 **/
#define PWM_OSS_OSSH2		(1 << 2)
/** PWM_OSS_OSSH1 Output Selection Set for PWMH output of the channel 1 **/
#define PWM_OSS_OSSH1		(1 << 1)
/** PWM_OSS_OSSH0 Output Selection Set for PWMH output of the channel 0 **/
#define PWM_OSS_OSSH0		(1 << 0)

/**@}*/

/** @defgroup pwm_osc OSC PWM Output Selection Clear Register
@{*/

/** PWM_OSC_OSCL7 Output Selection Clear for PWML output of the channel 7 **/
#define PWM_OSC_OSCL7		(1 << 23)
/** PWM_OSC_OSCL6 Output Selection Clear for PWML output of the channel 6 **/
#define PWM_OSC_OSCL6		(1 << 22)
/** PWM_OSC_OSCL5 Output Selection Clear for PWML output of the channel 5 **/
#define PWM_OSC_OSCL5		(1 << 21)
/** PWM_OSC_OSCL4 Output Selection Clear for PWML output of the channel 4 **/
#define PWM_OSC_OSCL4		(1 << 20)
/** PWM_OSC_OSCL3 Output Selection Clear for PWML output of the channel 3 **/
#define PWM_OSC_OSCL3		(1 << 19)
/** PWM_OSC_OSCL2 Output Selection Clear for PWML output of the channel 2 **/
#define PWM_OSC_OSCL2		(1 << 18)
/** PWM_OSC_OSCL1 Output Selection Clear for PWML output of the channel 1 **/
#define PWM_OSC_OSCL1		(1 << 17)
/** PWM_OSC_OSCL0 Output Selection Clear for PWML output of the channel 0 **/
#define PWM_OSC_OSCL0		(1 << 16)
/** PWM_OSC_OSCH7 Output Selection Clear for PWMH output of the channel 7 **/
#define PWM_OSC_OSCH7		(1 << 7)
/** PWM_OSC_OSCH6 Output Selection Clear for PWMH output of the channel 6 **/
#define PWM_OSC_OSCH6		(1 << 6)
/** PWM_OSC_OSCH5 Output Selection Clear for PWMH output of the channel 5 **/
#define PWM_OSC_OSCH5		(1 << 5)
/** PWM_OSC_OSCH4 Output Selection Clear for PWMH output of the channel 4 **/
#define PWM_OSC_OSCH4		(1 << 4)
/** PWM_OSC_OSCH3 Output Selection Clear for PWMH output of the channel 3 **/
#define PWM_OSC_OSCH3		(1 << 3)
/** PWM_OSC_OSCH2 Output Selection Clear for PWMH output of the channel 2 **/
#define PWM_OSC_OSCH2		(1 << 2)
/** PWM_OSC_OSCH1 Output Selection Clear for PWMH output of the channel 1 **/
#define PWM_OSC_OSCH1		(1 << 1)
/** PWM_OSC_OSCH0 Output Selection Clear for PWMH output of the channel 0 **/
#define PWM_OSC_OSCH0		(1 << 0)

/**@}*/

/** @defgroup pwm_ossupd OSSUPD PWM Output Selection Set Update Register
@{*/

/** PWM_OSSUPD_OSSUPL7 Output Selection Set for PWML output of the channel 7 **/
#define PWM_OSSUPD_OSSUPL7		(1 << 23)
/** PWM_OSSUPD_OSSUPL6 Output Selection Set for PWML output of the channel 6 **/
#define PWM_OSSUPD_OSSUPL6		(1 << 22)
/** PWM_OSSUPD_OSSUPL5 Output Selection Set for PWML output of the channel 5 **/
#define PWM_OSSUPD_OSSUPL5		(1 << 21)
/** PWM_OSSUPD_OSSUPL4 Output Selection Set for PWML output of the channel 4 **/
#define PWM_OSSUPD_OSSUPL4		(1 << 20)
/** PWM_OSSUPD_OSSUPL3 Output Selection Set for PWML output of the channel 3 **/
#define PWM_OSSUPD_OSSUPL3		(1 << 19)
/** PWM_OSSUPD_OSSUPL2 Output Selection Set for PWML output of the channel 2 **/
#define PWM_OSSUPD_OSSUPL2		(1 << 18)
/** PWM_OSSUPD_OSSUPL1 Output Selection Set for PWML output of the channel 1 **/
#define PWM_OSSUPD_OSSUPL1		(1 << 17)
/** PWM_OSSUPD_OSSUPL0 Output Selection Set for PWML output of the channel 0 **/
#define PWM_OSSUPD_OSSUPL0		(1 << 16)
/** PWM_OSSUPD_OSSUPH7 Output Selection Set for PWMH output of the channel 7 **/
#define PWM_OSSUPD_OSSUPH7		(1 << 7)
/** PWM_OSSUPD_OSSUPH6 Output Selection Set for PWMH output of the channel 6 **/
#define PWM_OSSUPD_OSSUPH6		(1 << 6)
/** PWM_OSSUPD_OSSUPH5 Output Selection Set for PWMH output of the channel 5 **/
#define PWM_OSSUPD_OSSUPH5		(1 << 5)
/** PWM_OSSUPD_OSSUPH4 Output Selection Set for PWMH output of the channel 4 **/
#define PWM_OSSUPD_OSSUPH4		(1 << 4)
/** PWM_OSSUPD_OSSUPH3 Output Selection Set for PWMH output of the channel 3 **/
#define PWM_OSSUPD_OSSUPH3		(1 << 3)
/** PWM_OSSUPD_OSSUPH2 Output Selection Set for PWMH output of the channel 2 **/
#define PWM_OSSUPD_OSSUPH2		(1 << 2)
/** PWM_OSSUPD_OSSUPH1 Output Selection Set for PWMH output of the channel 1 **/
#define PWM_OSSUPD_OSSUPH1		(1 << 1)
/** PWM_OSSUPD_OSSUPH0 Output Selection Set for PWMH output of the channel 0 **/
#define PWM_OSSUPD_OSSUPH0		(1 << 0)

/**@}*/

/** @defgroup pwm_oscupd OSCUPD PWM Output Selection Clear Update Register
@{*/

/** PWM_OSCUPD_OSCUPL7 Output Selection Clear for PWML output of the channel 7 **/
#define PWM_OSCUPD_OSCUPL7		(1 << 23)
/** PWM_OSCUPD_OSCUPL6 Output Selection Clear for PWML output of the channel 6 **/
#define PWM_OSCUPD_OSCUPL6		(1 << 22)
/** PWM_OSCUPD_OSCUPL5 Output Selection Clear for PWML output of the channel 5 **/
#define PWM_OSCUPD_OSCUPL5		(1 << 21)
/** PWM_OSCUPD_OSCUPL4 Output Selection Clear for PWML output of the channel 4 **/
#define PWM_OSCUPD_OSCUPL4		(1 << 20)
/** PWM_OSCUPD_OSCUPL3 Output Selection Clear for PWML output of the channel 3 **/
#define PWM_OSCUPD_OSCUPL3		(1 << 19)
/** PWM_OSCUPD_OSCUPL2 Output Selection Clear for PWML output of the channel 2 **/
#define PWM_OSCUPD_OSCUPL2		(1 << 18)
/** PWM_OSCUPD_OSCUPL1 Output Selection Clear for PWML output of the channel 1 **/
#define PWM_OSCUPD_OSCUPL1		(1 << 17)
/** PWM_OSCUPD_OSCUPL0 Output Selection Clear for PWML output of the channel 0 **/
#define PWM_OSCUPD_OSCUPL0		(1 << 16)
/** PWM_OSCUPD_OSCUPH7 Output Selection Clear for PWMH output of the channel 7 **/
#define PWM_OSCUPD_OSCUPH7		(1 << 7)
/** PWM_OSCUPD_OSCUPH6 Output Selection Clear for PWMH output of the channel 6 **/
#define PWM_OSCUPD_OSCUPH6		(1 << 6)
/** PWM_OSCUPD_OSCUPH5 Output Selection Clear for PWMH output of the channel 5 **/
#define PWM_OSCUPD_OSCUPH5		(1 << 5)
/** PWM_OSCUPD_OSCUPH4 Output Selection Clear for PWMH output of the channel 4 **/
#define PWM_OSCUPD_OSCUPH4		(1 << 4)
/** PWM_OSCUPD_OSCUPH3 Output Selection Clear for PWMH output of the channel 3 **/
#define PWM_OSCUPD_OSCUPH3		(1 << 3)
/** PWM_OSCUPD_OSCUPH2 Output Selection Clear for PWMH output of the channel 2 **/
#define PWM_OSCUPD_OSCUPH2		(1 << 2)
/** PWM_OSCUPD_OSCUPH1 Output Selection Clear for PWMH output of the channel 1 **/
#define PWM_OSCUPD_OSCUPH1		(1 << 1)
/** PWM_OSCUPD_OSCUPH0 Output Selection Clear for PWMH output of the channel 0 **/
#define PWM_OSCUPD_OSCUPH0		(1 << 0)

/**@}*/

/** @defgroup pwm_fmr FMR PWM Fault Mode Register
@{*/


