grevaillot/svd_tools/headers/ATSAM3X8H/pwm.h
#define PWM_FMR_FFIL_SHIFT		16
#define PWM_FMR_FFIL_MASK		0xff
/** @defgroup pwm_fmr_ffil FFIL Fault Filtering (fault input bit varies from 0 to 5)
@{*/
/**@}*/


#define PWM_FMR_FMOD_SHIFT		8
#define PWM_FMR_FMOD_MASK		0xff
/** @defgroup pwm_fmr_fmod FMOD Fault Activation Mode (fault input bit varies from 0 to 5)
@{*/
/**@}*/


#define PWM_FMR_FPOL_SHIFT		0
#define PWM_FMR_FPOL_MASK		0xff
/** @defgroup pwm_fmr_fpol FPOL Fault Polarity (fault input bit varies from 0 to 5)
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_fsr FSR PWM Fault Status Register
@{*/


#define PWM_FSR_FS_SHIFT		8
#define PWM_FSR_FS_MASK		0xff
/** @defgroup pwm_fsr_fs FS Fault Status (fault input bit varies from 0 to 5)
@{*/
/**@}*/


#define PWM_FSR_FIV_SHIFT		0
#define PWM_FSR_FIV_MASK		0xff
/** @defgroup pwm_fsr_fiv FIV Fault Input Value (fault input bit varies from 0 to 5)
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_fcr FCR PWM Fault Clear Register
@{*/


#define PWM_FCR_FCLR_SHIFT		0
#define PWM_FCR_FCLR_MASK		0xff
/** @defgroup pwm_fcr_fclr FCLR Fault Clear (fault input bit varies from 0 to 5)
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_fpv FPV PWM Fault Protection Value Register
@{*/

/** PWM_FPV_FPVL7 Fault Protection Value for PWML output on channel 7 **/
#define PWM_FPV_FPVL7		(1 << 23)
/** PWM_FPV_FPVL6 Fault Protection Value for PWML output on channel 6 **/
#define PWM_FPV_FPVL6		(1 << 22)
/** PWM_FPV_FPVL5 Fault Protection Value for PWML output on channel 5 **/
#define PWM_FPV_FPVL5		(1 << 21)
/** PWM_FPV_FPVL4 Fault Protection Value for PWML output on channel 4 **/
#define PWM_FPV_FPVL4		(1 << 20)
/** PWM_FPV_FPVL3 Fault Protection Value for PWML output on channel 3 **/
#define PWM_FPV_FPVL3		(1 << 19)
/** PWM_FPV_FPVL2 Fault Protection Value for PWML output on channel 2 **/
#define PWM_FPV_FPVL2		(1 << 18)
/** PWM_FPV_FPVL1 Fault Protection Value for PWML output on channel 1 **/
#define PWM_FPV_FPVL1		(1 << 17)
/** PWM_FPV_FPVL0 Fault Protection Value for PWML output on channel 0 **/
#define PWM_FPV_FPVL0		(1 << 16)
/** PWM_FPV_FPVH7 Fault Protection Value for PWMH output on channel 7 **/
#define PWM_FPV_FPVH7		(1 << 7)
/** PWM_FPV_FPVH6 Fault Protection Value for PWMH output on channel 6 **/
#define PWM_FPV_FPVH6		(1 << 6)
/** PWM_FPV_FPVH5 Fault Protection Value for PWMH output on channel 5 **/
#define PWM_FPV_FPVH5		(1 << 5)
/** PWM_FPV_FPVH4 Fault Protection Value for PWMH output on channel 4 **/
#define PWM_FPV_FPVH4		(1 << 4)
/** PWM_FPV_FPVH3 Fault Protection Value for PWMH output on channel 3 **/
#define PWM_FPV_FPVH3		(1 << 3)
/** PWM_FPV_FPVH2 Fault Protection Value for PWMH output on channel 2 **/
#define PWM_FPV_FPVH2		(1 << 2)
/** PWM_FPV_FPVH1 Fault Protection Value for PWMH output on channel 1 **/
#define PWM_FPV_FPVH1		(1 << 1)
/** PWM_FPV_FPVH0 Fault Protection Value for PWMH output on channel 0 **/
#define PWM_FPV_FPVH0		(1 << 0)

/**@}*/

/** @defgroup pwm_fpe1 FPE1 PWM Fault Protection Enable Register 1
@{*/


#define PWM_FPE1_FPE3_SHIFT		24
#define PWM_FPE1_FPE3_MASK		0xff
/** @defgroup pwm_fpe1_fpe3 FPE3 Fault Protection Enable for channel 3 (fault input bit varies from 0 to 5)
@{*/
/**@}*/


#define PWM_FPE1_FPE2_SHIFT		16
#define PWM_FPE1_FPE2_MASK		0xff
/** @defgroup pwm_fpe1_fpe2 FPE2 Fault Protection Enable for channel 2 (fault input bit varies from 0 to 5)
@{*/
/**@}*/


#define PWM_FPE1_FPE1_SHIFT		8
#define PWM_FPE1_FPE1_MASK		0xff
/** @defgroup pwm_fpe1_fpe1 FPE1 Fault Protection Enable for channel 1 (fault input bit varies from 0 to 5)
@{*/
/**@}*/


#define PWM_FPE1_FPE0_SHIFT		0
#define PWM_FPE1_FPE0_MASK		0xff
/** @defgroup pwm_fpe1_fpe0 FPE0 Fault Protection Enable for channel 0 (fault input bit varies from 0 to 5)
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_fpe2 FPE2 PWM Fault Protection Enable Register 2
@{*/


#define PWM_FPE2_FPE7_SHIFT		24
#define PWM_FPE2_FPE7_MASK		0xff
/** @defgroup pwm_fpe2_fpe7 FPE7 Fault Protection Enable for channel 7 (fault input bit varies from 0 to 5)
@{*/
/**@}*/


#define PWM_FPE2_FPE6_SHIFT		16
#define PWM_FPE2_FPE6_MASK		0xff
/** @defgroup pwm_fpe2_fpe6 FPE6 Fault Protection Enable for channel 6 (fault input bit varies from 0 to 5)
@{*/
/**@}*/


#define PWM_FPE2_FPE5_SHIFT		8
#define PWM_FPE2_FPE5_MASK		0xff
/** @defgroup pwm_fpe2_fpe5 FPE5 Fault Protection Enable for channel 5 (fault input bit varies from 0 to 5)
@{*/
/**@}*/


#define PWM_FPE2_FPE4_SHIFT		0
#define PWM_FPE2_FPE4_MASK		0xff
/** @defgroup pwm_fpe2_fpe4 FPE4 Fault Protection Enable for channel 4 (fault input bit varies from 0 to 5)
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_elmr[0] ELMR[0] PWM Event Line 0 Mode Register
@{*/

/** PWM_ELMR[0]_CSEL7 Comparison 7 Selection **/
#define PWM_ELMR[0]_CSEL7		(1 << 7)
/** PWM_ELMR[0]_CSEL6 Comparison 6 Selection **/
#define PWM_ELMR[0]_CSEL6		(1 << 6)
/** PWM_ELMR[0]_CSEL5 Comparison 5 Selection **/
#define PWM_ELMR[0]_CSEL5		(1 << 5)
/** PWM_ELMR[0]_CSEL4 Comparison 4 Selection **/
#define PWM_ELMR[0]_CSEL4		(1 << 4)
/** PWM_ELMR[0]_CSEL3 Comparison 3 Selection **/
#define PWM_ELMR[0]_CSEL3		(1 << 3)
/** PWM_ELMR[0]_CSEL2 Comparison 2 Selection **/
#define PWM_ELMR[0]_CSEL2		(1 << 2)
/** PWM_ELMR[0]_CSEL1 Comparison 1 Selection **/
#define PWM_ELMR[0]_CSEL1		(1 << 1)
/** PWM_ELMR[0]_CSEL0 Comparison 0 Selection **/
#define PWM_ELMR[0]_CSEL0		(1 << 0)

/**@}*/

/** @defgroup pwm_elmr[1] ELMR[1] PWM Event Line 0 Mode Register
@{*/

/** PWM_ELMR[1]_CSEL7 Comparison 7 Selection **/
#define PWM_ELMR[1]_CSEL7		(1 << 7)
/** PWM_ELMR[1]_CSEL6 Comparison 6 Selection **/
#define PWM_ELMR[1]_CSEL6		(1 << 6)
/** PWM_ELMR[1]_CSEL5 Comparison 5 Selection **/
#define PWM_ELMR[1]_CSEL5		(1 << 5)
/** PWM_ELMR[1]_CSEL4 Comparison 4 Selection **/
#define PWM_ELMR[1]_CSEL4		(1 << 4)
/** PWM_ELMR[1]_CSEL3 Comparison 3 Selection **/
#define PWM_ELMR[1]_CSEL3		(1 << 3)
/** PWM_ELMR[1]_CSEL2 Comparison 2 Selection **/
#define PWM_ELMR[1]_CSEL2		(1 << 2)
/** PWM_ELMR[1]_CSEL1 Comparison 1 Selection **/
#define PWM_ELMR[1]_CSEL1		(1 << 1)
/** PWM_ELMR[1]_CSEL0 Comparison 0 Selection **/
#define PWM_ELMR[1]_CSEL0		(1 << 0)

/**@}*/

