grevaillot/svd_tools/headers/ATSAM3X8H/pwm.h
/** @defgroup pwm_smmr SMMR PWM Stepper Motor Mode Register
@{*/

/** PWM_SMMR_DOWN3 DOWN Count **/
#define PWM_SMMR_DOWN3		(1 << 19)
/** PWM_SMMR_DOWN2 DOWN Count **/
#define PWM_SMMR_DOWN2		(1 << 18)
/** PWM_SMMR_DOWN1 DOWN Count **/
#define PWM_SMMR_DOWN1		(1 << 17)
/** PWM_SMMR_DOWN0 DOWN Count **/
#define PWM_SMMR_DOWN0		(1 << 16)
/** PWM_SMMR_GCEN3 Gray Count ENable **/
#define PWM_SMMR_GCEN3		(1 << 3)
/** PWM_SMMR_GCEN2 Gray Count ENable **/
#define PWM_SMMR_GCEN2		(1 << 2)
/** PWM_SMMR_GCEN1 Gray Count ENable **/
#define PWM_SMMR_GCEN1		(1 << 1)
/** PWM_SMMR_GCEN0 Gray Count ENable **/
#define PWM_SMMR_GCEN0		(1 << 0)

/**@}*/

/** @defgroup pwm_wpcr WPCR PWM Write Protect Control Register
@{*/


#define PWM_WPCR_WPKEY_SHIFT		8
#define PWM_WPCR_WPKEY_MASK		0xffffff
/** @defgroup pwm_wpcr_wpkey WPKEY Write Protect Key
@{*/
/**@}*/

/** PWM_WPCR_WPRG5 Write Protect Register Group 5 **/
#define PWM_WPCR_WPRG5		(1 << 7)
/** PWM_WPCR_WPRG4 Write Protect Register Group 4 **/
#define PWM_WPCR_WPRG4		(1 << 6)
/** PWM_WPCR_WPRG3 Write Protect Register Group 3 **/
#define PWM_WPCR_WPRG3		(1 << 5)
/** PWM_WPCR_WPRG2 Write Protect Register Group 2 **/
#define PWM_WPCR_WPRG2		(1 << 4)
/** PWM_WPCR_WPRG1 Write Protect Register Group 1 **/
#define PWM_WPCR_WPRG1		(1 << 3)
/** PWM_WPCR_WPRG0 Write Protect Register Group 0 **/
#define PWM_WPCR_WPRG0		(1 << 2)

#define PWM_WPCR_WPCMD_SHIFT		0
#define PWM_WPCR_WPCMD_MASK		0x03
/** @defgroup pwm_wpcr_wpcmd WPCMD Write Protect Command
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_wpsr WPSR PWM Write Protect Status Register
@{*/


#define PWM_WPSR_WPVSRC_SHIFT		16
#define PWM_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pwm_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** PWM_WPSR_WPHWS5 Write Protect HW Status **/
#define PWM_WPSR_WPHWS5		(1 << 13)
/** PWM_WPSR_WPHWS4 Write Protect HW Status **/
#define PWM_WPSR_WPHWS4		(1 << 12)
/** PWM_WPSR_WPHWS3 Write Protect HW Status **/
#define PWM_WPSR_WPHWS3		(1 << 11)
/** PWM_WPSR_WPHWS2 Write Protect HW Status **/
#define PWM_WPSR_WPHWS2		(1 << 10)
/** PWM_WPSR_WPHWS1 Write Protect HW Status **/
#define PWM_WPSR_WPHWS1		(1 << 9)
/** PWM_WPSR_WPHWS0 Write Protect HW Status **/
#define PWM_WPSR_WPHWS0		(1 << 8)
/** PWM_WPSR_WPVS Write Protect Violation Status **/
#define PWM_WPSR_WPVS		(1 << 7)
/** PWM_WPSR_WPSWS5 Write Protect SW Status **/
#define PWM_WPSR_WPSWS5		(1 << 5)
/** PWM_WPSR_WPSWS4 Write Protect SW Status **/
#define PWM_WPSR_WPSWS4		(1 << 4)
/** PWM_WPSR_WPSWS3 Write Protect SW Status **/
#define PWM_WPSR_WPSWS3		(1 << 3)
/** PWM_WPSR_WPSWS2 Write Protect SW Status **/
#define PWM_WPSR_WPSWS2		(1 << 2)
/** PWM_WPSR_WPSWS1 Write Protect SW Status **/
#define PWM_WPSR_WPSWS1		(1 << 1)
/** PWM_WPSR_WPSWS0 Write Protect SW Status **/
#define PWM_WPSR_WPSWS0		(1 << 0)

/**@}*/

/** @defgroup pwm_tpr TPR Transmit Pointer Register
@{*/


#define PWM_TPR_TXPTR_SHIFT		0
#define PWM_TPR_TXPTR_MASK		0xffffffff
/** @defgroup pwm_tpr_txptr TXPTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_tcr TCR Transmit Counter Register
@{*/


#define PWM_TCR_TXCTR_SHIFT		0
#define PWM_TCR_TXCTR_MASK		0xffff
/** @defgroup pwm_tcr_txctr TXCTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_tnpr TNPR Transmit Next Pointer Register
@{*/


#define PWM_TNPR_TXNPTR_SHIFT		0
#define PWM_TNPR_TXNPTR_MASK		0xffffffff
/** @defgroup pwm_tnpr_txnptr TXNPTR Transmit Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_tncr TNCR Transmit Next Counter Register
@{*/


#define PWM_TNCR_TXNCTR_SHIFT		0
#define PWM_TNCR_TXNCTR_MASK		0xffff
/** @defgroup pwm_tncr_txnctr TXNCTR Transmit Counter Next
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ptcr PTCR Transfer Control Register
@{*/

/** PWM_PTCR_TXTDIS Transmitter Transfer Disable **/
#define PWM_PTCR_TXTDIS		(1 << 9)
/** PWM_PTCR_TXTEN Transmitter Transfer Enable **/
#define PWM_PTCR_TXTEN		(1 << 8)
/** PWM_PTCR_RXTDIS Receiver Transfer Disable **/
#define PWM_PTCR_RXTDIS		(1 << 1)
/** PWM_PTCR_RXTEN Receiver Transfer Enable **/
#define PWM_PTCR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup pwm_ptsr PTSR Transfer Status Register
@{*/

/** PWM_PTSR_TXTEN Transmitter Transfer Enable **/
#define PWM_PTSR_TXTEN		(1 << 8)
/** PWM_PTSR_RXTEN Receiver Transfer Enable **/
#define PWM_PTSR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpv0 CMPV0 PWM Comparison 0 Value Register
@{*/

/** PWM_CMPV0_CVM Comparison x Value Mode **/
#define PWM_CMPV0_CVM		(1 << 24)

#define PWM_CMPV0_CV_SHIFT		0
#define PWM_CMPV0_CV_MASK		0xffffff
/** @defgroup pwm_cmpv0_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpvupd0 CMPVUPD0 PWM Comparison 0 Value Update Register
@{*/

/** PWM_CMPVUPD0_CVMUPD Comparison x Value Mode Update **/
#define PWM_CMPVUPD0_CVMUPD		(1 << 24)

#define PWM_CMPVUPD0_CVUPD_SHIFT		0
#define PWM_CMPVUPD0_CVUPD_MASK		0xffffff
/** @defgroup pwm_cmpvupd0_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpm0 CMPM0 PWM Comparison 0 Mode Register
@{*/


#define PWM_CMPM0_CUPRCNT_SHIFT		20
#define PWM_CMPM0_CUPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm0_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM_CMPM0_CUPR_SHIFT		16
#define PWM_CMPM0_CUPR_MASK		0x0f
/** @defgroup pwm_cmpm0_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM_CMPM0_CPRCNT_SHIFT		12
#define PWM_CMPM0_CPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm0_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM_CMPM0_CPR_SHIFT		8
#define PWM_CMPM0_CPR_MASK		0x0f
/** @defgroup pwm_cmpm0_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM_CMPM0_CTR_SHIFT		4
#define PWM_CMPM0_CTR_MASK		0x0f
/** @defgroup pwm_cmpm0_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM_CMPM0_CEN Comparison x Enable **/
#define PWM_CMPM0_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpmupd0 CMPMUPD0 PWM Comparison 0 Mode Update Register
@{*/


#define PWM_CMPMUPD0_CUPRUPD_SHIFT		16
#define PWM_CMPMUPD0_CUPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd0_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD0_CPRUPD_SHIFT		8
#define PWM_CMPMUPD0_CPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd0_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD0_CTRUPD_SHIFT		4
#define PWM_CMPMUPD0_CTRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd0_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

