grevaillot/svd_tools/headers/ATSAM3X8H/pwm.h
/** PWM_CMPMUPD0_CENUPD Comparison x Enable Update **/
#define PWM_CMPMUPD0_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpv1 CMPV1 PWM Comparison 1 Value Register
@{*/

/** PWM_CMPV1_CVM Comparison x Value Mode **/
#define PWM_CMPV1_CVM		(1 << 24)

#define PWM_CMPV1_CV_SHIFT		0
#define PWM_CMPV1_CV_MASK		0xffffff
/** @defgroup pwm_cmpv1_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpvupd1 CMPVUPD1 PWM Comparison 1 Value Update Register
@{*/

/** PWM_CMPVUPD1_CVMUPD Comparison x Value Mode Update **/
#define PWM_CMPVUPD1_CVMUPD		(1 << 24)

#define PWM_CMPVUPD1_CVUPD_SHIFT		0
#define PWM_CMPVUPD1_CVUPD_MASK		0xffffff
/** @defgroup pwm_cmpvupd1_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpm1 CMPM1 PWM Comparison 1 Mode Register
@{*/


#define PWM_CMPM1_CUPRCNT_SHIFT		20
#define PWM_CMPM1_CUPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm1_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM_CMPM1_CUPR_SHIFT		16
#define PWM_CMPM1_CUPR_MASK		0x0f
/** @defgroup pwm_cmpm1_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM_CMPM1_CPRCNT_SHIFT		12
#define PWM_CMPM1_CPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm1_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM_CMPM1_CPR_SHIFT		8
#define PWM_CMPM1_CPR_MASK		0x0f
/** @defgroup pwm_cmpm1_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM_CMPM1_CTR_SHIFT		4
#define PWM_CMPM1_CTR_MASK		0x0f
/** @defgroup pwm_cmpm1_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM_CMPM1_CEN Comparison x Enable **/
#define PWM_CMPM1_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpmupd1 CMPMUPD1 PWM Comparison 1 Mode Update Register
@{*/


#define PWM_CMPMUPD1_CUPRUPD_SHIFT		16
#define PWM_CMPMUPD1_CUPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd1_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD1_CPRUPD_SHIFT		8
#define PWM_CMPMUPD1_CPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd1_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD1_CTRUPD_SHIFT		4
#define PWM_CMPMUPD1_CTRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd1_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM_CMPMUPD1_CENUPD Comparison x Enable Update **/
#define PWM_CMPMUPD1_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpv2 CMPV2 PWM Comparison 2 Value Register
@{*/

/** PWM_CMPV2_CVM Comparison x Value Mode **/
#define PWM_CMPV2_CVM		(1 << 24)

#define PWM_CMPV2_CV_SHIFT		0
#define PWM_CMPV2_CV_MASK		0xffffff
/** @defgroup pwm_cmpv2_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpvupd2 CMPVUPD2 PWM Comparison 2 Value Update Register
@{*/

/** PWM_CMPVUPD2_CVMUPD Comparison x Value Mode Update **/
#define PWM_CMPVUPD2_CVMUPD		(1 << 24)

#define PWM_CMPVUPD2_CVUPD_SHIFT		0
#define PWM_CMPVUPD2_CVUPD_MASK		0xffffff
/** @defgroup pwm_cmpvupd2_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpm2 CMPM2 PWM Comparison 2 Mode Register
@{*/


#define PWM_CMPM2_CUPRCNT_SHIFT		20
#define PWM_CMPM2_CUPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm2_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM_CMPM2_CUPR_SHIFT		16
#define PWM_CMPM2_CUPR_MASK		0x0f
/** @defgroup pwm_cmpm2_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM_CMPM2_CPRCNT_SHIFT		12
#define PWM_CMPM2_CPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm2_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM_CMPM2_CPR_SHIFT		8
#define PWM_CMPM2_CPR_MASK		0x0f
/** @defgroup pwm_cmpm2_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM_CMPM2_CTR_SHIFT		4
#define PWM_CMPM2_CTR_MASK		0x0f
/** @defgroup pwm_cmpm2_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM_CMPM2_CEN Comparison x Enable **/
#define PWM_CMPM2_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpmupd2 CMPMUPD2 PWM Comparison 2 Mode Update Register
@{*/


#define PWM_CMPMUPD2_CUPRUPD_SHIFT		16
#define PWM_CMPMUPD2_CUPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd2_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD2_CPRUPD_SHIFT		8
#define PWM_CMPMUPD2_CPRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd2_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM_CMPMUPD2_CTRUPD_SHIFT		4
#define PWM_CMPMUPD2_CTRUPD_MASK		0x0f
/** @defgroup pwm_cmpmupd2_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM_CMPMUPD2_CENUPD Comparison x Enable Update **/
#define PWM_CMPMUPD2_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpv3 CMPV3 PWM Comparison 3 Value Register
@{*/

/** PWM_CMPV3_CVM Comparison x Value Mode **/
#define PWM_CMPV3_CVM		(1 << 24)

#define PWM_CMPV3_CV_SHIFT		0
#define PWM_CMPV3_CV_MASK		0xffffff
/** @defgroup pwm_cmpv3_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpvupd3 CMPVUPD3 PWM Comparison 3 Value Update Register
@{*/

/** PWM_CMPVUPD3_CVMUPD Comparison x Value Mode Update **/
#define PWM_CMPVUPD3_CVMUPD		(1 << 24)

#define PWM_CMPVUPD3_CVUPD_SHIFT		0
#define PWM_CMPVUPD3_CVUPD_MASK		0xffffff
/** @defgroup pwm_cmpvupd3_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmpm3 CMPM3 PWM Comparison 3 Mode Register
@{*/


#define PWM_CMPM3_CUPRCNT_SHIFT		20
#define PWM_CMPM3_CUPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm3_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM_CMPM3_CUPR_SHIFT		16
#define PWM_CMPM3_CUPR_MASK		0x0f
/** @defgroup pwm_cmpm3_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM_CMPM3_CPRCNT_SHIFT		12
#define PWM_CMPM3_CPRCNT_MASK		0x0f
/** @defgroup pwm_cmpm3_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM_CMPM3_CPR_SHIFT		8
#define PWM_CMPM3_CPR_MASK		0x0f
/** @defgroup pwm_cmpm3_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM_CMPM3_CTR_SHIFT		4
#define PWM_CMPM3_CTR_MASK		0x0f
/** @defgroup pwm_cmpm3_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM_CMPM3_CEN Comparison x Enable **/
#define PWM_CMPM3_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm_cmpmupd3 CMPMUPD3 PWM Comparison 3 Mode Update Register
@{*/


