grevaillot/svd_tools/headers/ATSAM3X8H/pwm.h
#define PWM_CPRDUPD3_CPRDUPD_SHIFT		0
#define PWM_CPRDUPD3_CPRDUPD_MASK		0xffffff
/** @defgroup pwm_cprdupd3_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ccnt3 CCNT3 PWM Channel Counter Register (ch_num = 3)
@{*/


#define PWM_CCNT3_CNT_SHIFT		0
#define PWM_CCNT3_CNT_MASK		0xffffff
/** @defgroup pwm_ccnt3_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dt3 DT3 PWM Channel Dead Time Register (ch_num = 3)
@{*/


#define PWM_DT3_DTL_SHIFT		16
#define PWM_DT3_DTL_MASK		0xffff
/** @defgroup pwm_dt3_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM_DT3_DTH_SHIFT		0
#define PWM_DT3_DTH_MASK		0xffff
/** @defgroup pwm_dt3_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dtupd3 DTUPD3 PWM Channel Dead Time Update Register (ch_num = 3)
@{*/


#define PWM_DTUPD3_DTLUPD_SHIFT		16
#define PWM_DTUPD3_DTLUPD_MASK		0xffff
/** @defgroup pwm_dtupd3_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM_DTUPD3_DTHUPD_SHIFT		0
#define PWM_DTUPD3_DTHUPD_MASK		0xffff
/** @defgroup pwm_dtupd3_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmr4 CMR4 PWM Channel Mode Register (ch_num = 4)
@{*/

/** PWM_CMR4_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM_CMR4_DTLI		(1 << 18)
/** PWM_CMR4_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM_CMR4_DTHI		(1 << 17)
/** PWM_CMR4_DTE Dead-Time Generator Enable **/
#define PWM_CMR4_DTE		(1 << 16)
/** PWM_CMR4_CES Counter Event Selection **/
#define PWM_CMR4_CES		(1 << 10)
/** PWM_CMR4_CPOL Channel Polarity **/
#define PWM_CMR4_CPOL		(1 << 9)
/** PWM_CMR4_CALG Channel Alignment **/
#define PWM_CMR4_CALG		(1 << 8)

#define PWM_CMR4_CPRE_SHIFT		0
#define PWM_CMR4_CPRE_MASK		0x0f
/** @defgroup pwm_cmr4_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdty4 CDTY4 PWM Channel Duty Cycle Register (ch_num = 4)
@{*/


#define PWM_CDTY4_CDTY_SHIFT		0
#define PWM_CDTY4_CDTY_MASK		0xffffff
/** @defgroup pwm_cdty4_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdtyupd4 CDTYUPD4 PWM Channel Duty Cycle Update Register (ch_num = 4)
@{*/


#define PWM_CDTYUPD4_CDTYUPD_SHIFT		0
#define PWM_CDTYUPD4_CDTYUPD_MASK		0xffffff
/** @defgroup pwm_cdtyupd4_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprd4 CPRD4 PWM Channel Period Register (ch_num = 4)
@{*/


#define PWM_CPRD4_CPRD_SHIFT		0
#define PWM_CPRD4_CPRD_MASK		0xffffff
/** @defgroup pwm_cprd4_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprdupd4 CPRDUPD4 PWM Channel Period Update Register (ch_num = 4)
@{*/


#define PWM_CPRDUPD4_CPRDUPD_SHIFT		0
#define PWM_CPRDUPD4_CPRDUPD_MASK		0xffffff
/** @defgroup pwm_cprdupd4_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ccnt4 CCNT4 PWM Channel Counter Register (ch_num = 4)
@{*/


#define PWM_CCNT4_CNT_SHIFT		0
#define PWM_CCNT4_CNT_MASK		0xffffff
/** @defgroup pwm_ccnt4_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dt4 DT4 PWM Channel Dead Time Register (ch_num = 4)
@{*/


#define PWM_DT4_DTL_SHIFT		16
#define PWM_DT4_DTL_MASK		0xffff
/** @defgroup pwm_dt4_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM_DT4_DTH_SHIFT		0
#define PWM_DT4_DTH_MASK		0xffff
/** @defgroup pwm_dt4_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dtupd4 DTUPD4 PWM Channel Dead Time Update Register (ch_num = 4)
@{*/


#define PWM_DTUPD4_DTLUPD_SHIFT		16
#define PWM_DTUPD4_DTLUPD_MASK		0xffff
/** @defgroup pwm_dtupd4_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM_DTUPD4_DTHUPD_SHIFT		0
#define PWM_DTUPD4_DTHUPD_MASK		0xffff
/** @defgroup pwm_dtupd4_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmr5 CMR5 PWM Channel Mode Register (ch_num = 5)
@{*/

/** PWM_CMR5_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM_CMR5_DTLI		(1 << 18)
/** PWM_CMR5_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM_CMR5_DTHI		(1 << 17)
/** PWM_CMR5_DTE Dead-Time Generator Enable **/
#define PWM_CMR5_DTE		(1 << 16)
/** PWM_CMR5_CES Counter Event Selection **/
#define PWM_CMR5_CES		(1 << 10)
/** PWM_CMR5_CPOL Channel Polarity **/
#define PWM_CMR5_CPOL		(1 << 9)
/** PWM_CMR5_CALG Channel Alignment **/
#define PWM_CMR5_CALG		(1 << 8)

#define PWM_CMR5_CPRE_SHIFT		0
#define PWM_CMR5_CPRE_MASK		0x0f
/** @defgroup pwm_cmr5_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdty5 CDTY5 PWM Channel Duty Cycle Register (ch_num = 5)
@{*/


#define PWM_CDTY5_CDTY_SHIFT		0
#define PWM_CDTY5_CDTY_MASK		0xffffff
/** @defgroup pwm_cdty5_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdtyupd5 CDTYUPD5 PWM Channel Duty Cycle Update Register (ch_num = 5)
@{*/


#define PWM_CDTYUPD5_CDTYUPD_SHIFT		0
#define PWM_CDTYUPD5_CDTYUPD_MASK		0xffffff
/** @defgroup pwm_cdtyupd5_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprd5 CPRD5 PWM Channel Period Register (ch_num = 5)
@{*/


#define PWM_CPRD5_CPRD_SHIFT		0
#define PWM_CPRD5_CPRD_MASK		0xffffff
/** @defgroup pwm_cprd5_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprdupd5 CPRDUPD5 PWM Channel Period Update Register (ch_num = 5)
@{*/


#define PWM_CPRDUPD5_CPRDUPD_SHIFT		0
#define PWM_CPRDUPD5_CPRDUPD_MASK		0xffffff
/** @defgroup pwm_cprdupd5_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ccnt5 CCNT5 PWM Channel Counter Register (ch_num = 5)
@{*/


#define PWM_CCNT5_CNT_SHIFT		0
#define PWM_CCNT5_CNT_MASK		0xffffff
/** @defgroup pwm_ccnt5_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dt5 DT5 PWM Channel Dead Time Register (ch_num = 5)
@{*/


#define PWM_DT5_DTL_SHIFT		16
#define PWM_DT5_DTL_MASK		0xffff
/** @defgroup pwm_dt5_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM_DT5_DTH_SHIFT		0
#define PWM_DT5_DTH_MASK		0xffff
/** @defgroup pwm_dt5_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dtupd5 DTUPD5 PWM Channel Dead Time Update Register (ch_num = 5)
@{*/


#define PWM_DTUPD5_DTLUPD_SHIFT		16
#define PWM_DTUPD5_DTLUPD_MASK		0xffff
/** @defgroup pwm_dtupd5_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM_DTUPD5_DTHUPD_SHIFT		0
#define PWM_DTUPD5_DTHUPD_MASK		0xffff
/** @defgroup pwm_dtupd5_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmr6 CMR6 PWM Channel Mode Register (ch_num = 6)
@{*/

/** PWM_CMR6_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM_CMR6_DTLI		(1 << 18)
/** PWM_CMR6_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM_CMR6_DTHI		(1 << 17)
/** PWM_CMR6_DTE Dead-Time Generator Enable **/
#define PWM_CMR6_DTE		(1 << 16)
/** PWM_CMR6_CES Counter Event Selection **/
#define PWM_CMR6_CES		(1 << 10)
/** PWM_CMR6_CPOL Channel Polarity **/
#define PWM_CMR6_CPOL		(1 << 9)
/** PWM_CMR6_CALG Channel Alignment **/
#define PWM_CMR6_CALG		(1 << 8)

#define PWM_CMR6_CPRE_SHIFT		0
#define PWM_CMR6_CPRE_MASK		0x0f
/** @defgroup pwm_cmr6_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

