grevaillot/svd_tools/headers/ATSAM3X8H/pwm.h
/** @defgroup pwm_cdty6 CDTY6 PWM Channel Duty Cycle Register (ch_num = 6)
@{*/


#define PWM_CDTY6_CDTY_SHIFT		0
#define PWM_CDTY6_CDTY_MASK		0xffffff
/** @defgroup pwm_cdty6_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdtyupd6 CDTYUPD6 PWM Channel Duty Cycle Update Register (ch_num = 6)
@{*/


#define PWM_CDTYUPD6_CDTYUPD_SHIFT		0
#define PWM_CDTYUPD6_CDTYUPD_MASK		0xffffff
/** @defgroup pwm_cdtyupd6_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprd6 CPRD6 PWM Channel Period Register (ch_num = 6)
@{*/


#define PWM_CPRD6_CPRD_SHIFT		0
#define PWM_CPRD6_CPRD_MASK		0xffffff
/** @defgroup pwm_cprd6_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprdupd6 CPRDUPD6 PWM Channel Period Update Register (ch_num = 6)
@{*/


#define PWM_CPRDUPD6_CPRDUPD_SHIFT		0
#define PWM_CPRDUPD6_CPRDUPD_MASK		0xffffff
/** @defgroup pwm_cprdupd6_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ccnt6 CCNT6 PWM Channel Counter Register (ch_num = 6)
@{*/


#define PWM_CCNT6_CNT_SHIFT		0
#define PWM_CCNT6_CNT_MASK		0xffffff
/** @defgroup pwm_ccnt6_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dt6 DT6 PWM Channel Dead Time Register (ch_num = 6)
@{*/


#define PWM_DT6_DTL_SHIFT		16
#define PWM_DT6_DTL_MASK		0xffff
/** @defgroup pwm_dt6_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM_DT6_DTH_SHIFT		0
#define PWM_DT6_DTH_MASK		0xffff
/** @defgroup pwm_dt6_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dtupd6 DTUPD6 PWM Channel Dead Time Update Register (ch_num = 6)
@{*/


#define PWM_DTUPD6_DTLUPD_SHIFT		16
#define PWM_DTUPD6_DTLUPD_MASK		0xffff
/** @defgroup pwm_dtupd6_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM_DTUPD6_DTHUPD_SHIFT		0
#define PWM_DTUPD6_DTHUPD_MASK		0xffff
/** @defgroup pwm_dtupd6_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cmr7 CMR7 PWM Channel Mode Register (ch_num = 7)
@{*/

/** PWM_CMR7_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM_CMR7_DTLI		(1 << 18)
/** PWM_CMR7_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM_CMR7_DTHI		(1 << 17)
/** PWM_CMR7_DTE Dead-Time Generator Enable **/
#define PWM_CMR7_DTE		(1 << 16)
/** PWM_CMR7_CES Counter Event Selection **/
#define PWM_CMR7_CES		(1 << 10)
/** PWM_CMR7_CPOL Channel Polarity **/
#define PWM_CMR7_CPOL		(1 << 9)
/** PWM_CMR7_CALG Channel Alignment **/
#define PWM_CMR7_CALG		(1 << 8)

#define PWM_CMR7_CPRE_SHIFT		0
#define PWM_CMR7_CPRE_MASK		0x0f
/** @defgroup pwm_cmr7_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdty7 CDTY7 PWM Channel Duty Cycle Register (ch_num = 7)
@{*/


#define PWM_CDTY7_CDTY_SHIFT		0
#define PWM_CDTY7_CDTY_MASK		0xffffff
/** @defgroup pwm_cdty7_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cdtyupd7 CDTYUPD7 PWM Channel Duty Cycle Update Register (ch_num = 7)
@{*/


#define PWM_CDTYUPD7_CDTYUPD_SHIFT		0
#define PWM_CDTYUPD7_CDTYUPD_MASK		0xffffff
/** @defgroup pwm_cdtyupd7_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprd7 CPRD7 PWM Channel Period Register (ch_num = 7)
@{*/


#define PWM_CPRD7_CPRD_SHIFT		0
#define PWM_CPRD7_CPRD_MASK		0xffffff
/** @defgroup pwm_cprd7_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_cprdupd7 CPRDUPD7 PWM Channel Period Update Register (ch_num = 7)
@{*/


#define PWM_CPRDUPD7_CPRDUPD_SHIFT		0
#define PWM_CPRDUPD7_CPRDUPD_MASK		0xffffff
/** @defgroup pwm_cprdupd7_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_ccnt7 CCNT7 PWM Channel Counter Register (ch_num = 7)
@{*/


#define PWM_CCNT7_CNT_SHIFT		0
#define PWM_CCNT7_CNT_MASK		0xffffff
/** @defgroup pwm_ccnt7_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dt7 DT7 PWM Channel Dead Time Register (ch_num = 7)
@{*/


#define PWM_DT7_DTL_SHIFT		16
#define PWM_DT7_DTL_MASK		0xffff
/** @defgroup pwm_dt7_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM_DT7_DTH_SHIFT		0
#define PWM_DT7_DTH_MASK		0xffff
/** @defgroup pwm_dt7_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm_dtupd7 DTUPD7 PWM Channel Dead Time Update Register (ch_num = 7)
@{*/


#define PWM_DTUPD7_DTLUPD_SHIFT		16
#define PWM_DTUPD7_DTLUPD_MASK		0xffff
/** @defgroup pwm_dtupd7_dtlupd DTLUPD Dead-Time Value Update for PWMLx Output
@{*/
/**@}*/


#define PWM_DTUPD7_DTHUPD_SHIFT		0
#define PWM_DTUPD7_DTHUPD_MASK		0xffff
/** @defgroup pwm_dtupd7_dthupd DTHUPD Dead-Time Value Update for PWMHx Output
@{*/
/**@}*/


/**@}*/
